{
  "name": "Benjamin Payet",
  "downloadResume": "Télécharger le CV",
  "personalInformation": "Informations personnelles",
  "whoIAm": "Qui suis-je ?",
  "revealContactDetails": "Révéler les détails de contact",
  "phoneNumberName": "Téléphone",
  "emailName": "Email",
  "emailAddress": "Adresse e-mail",
  "locationName": "Localisation",
  "location": "Ile de France, France",
  "birthdayName": "Date de naissance",
  "birthday": "05 Août 1998",
  "whatIDo": "Ce que je fais!",
  "resumeMenu": "Mon parcours",
  "resume": "CV",
  "all": "Tout",
  "proficiencyHuman": "Compétences humaines",
  "proficiencyTechnical": "Compétences techniques",
  "contactMe": "Contactez-moi",
  "contactMePart1": "Si vous avez des questions ou si vous souhaitez simplement discuter, n'hésitez pas à ",
  "contactMePart2": "me contacter",
  "nameEmailForm": "Nom",
  "email": "Email",
  "message": "Message",
  "submit": "Envoyer",
  "workingSkills": "Compétences professionnelles",
  "knowledge": "Connaissances",
  "education": "Formation",
  "experience": "Expérience",
  "intech": "INTECH Paris (Groupe ESIEA)",
  "intechDescription": "Master en ingienerie logicielle",
  "commercialLicense": "Université Paris Descartes",
  "commercialLicenseDescription": "Licence professionnelle en commerce international",
  "bts": "Lycée de Bras Fusil (La Réunion)",
  "btsDescription": "BTS Management des Unités Commerciales (MUC)",
  "Lycee": "Lycée Amiral Pierre Bouvet (La Réunion)",
  "LyceeDescription": "Baccalauréat Scientifique option SVT mention Bien",
  "Invivo": "Invivo France – Développeur Full-Stack",
  "InvivoDescription": "Développement d'une application web de gestion de données et de reporting",
  "ESIEA": "Groupe Esiea – Alternance en tant que\nDéveloppeur Full-Stack (18 mois)",
  "ESIEADescription": "Utilisation de Go et Quasar/VueJS/Typescript pour\nla création d’un ERP(Enterprise Resource Planning) pour l’école",
  "Thales": "Thales GTS – Stage en tant que\nDéveloppeur d'outils Dashboard (6 mois)",
  "ThalesDescription": "Création d'un outil de reporting pour le suivi des équipes de développement",
  "Degetel": "Degetel – Alternance en tant que\nAssistant Ingénieur Etudes et Développement (12 mois)",
  "DegetelDescription": "Utilisation de Salesforce, MySQL, Matlab et Google\nCloud Platform afin d’optimiser la direction de\nl’entreprise",

  "proficiencyHumanTitle1": "Curiosité",
  "proficiencyHumanText1": "La curiosité est une compétence essentielle dans le domaine professionnel, qui se traduit par un désir actif de découvrir, d'apprendre et de comprendre de nouvelles choses. C'est une attitude qui pousse à poser des questions, à explorer différentes perspectives et à chercher des solutions innovantes.\n\nLa curiosité est importante pour moi car elle me permet de continuer à grandir et à évoluer professionnellement. Elle stimule ma créativité, ma capacité à résoudre les problèmes et ma volonté d'explorer de nouvelles opportunités. Ma curiosité m'a également permis d'approfondir mes connaissances dans des domaines connexes, renforçant ainsi ma polyvalence et ma capacité à contribuer de manière holistique aux projets.\n\nPar exemple, j'ai récemment entrepris une formation en ligne sur une nouvelle technologie émergente, ce qui m'a permis de développer de nouvelles compétences et de les appliquer avec succès dans un projet ultérieur. J'ai également proposé des idées innovantes lors de réunions d'équipe, basées sur ma recherche proactive et ma volonté de penser différemment.\n\nMon niveau de maîtrise de la compétence de curiosité est élevé, car je suis constamment à la recherche de nouvelles connaissances et de nouvelles expériences pour enrichir ma pratique professionnelle. Je reste ouvert à l'amélioration continue et je prévois de continuer à nourrir ma curiosité en explorant de nouveaux domaines, en développant de nouvelles compétences et en élargissant mes horizons professionnels.",
  "proficiencyHumanTitle2": "Autonomie",
  "proficiencyHumanText2": "L'autonomie est une compétence clé dans le domaine professionnel, qui se caractérise par la capacité à prendre des initiatives, à travailler de manière indépendante et à assumer la responsabilité de ses propres actions. C'est la capacité à être autonome dans la planification, l'organisation et l'exécution des tâches, tout en faisant preuve de discernement et de prise de décision judicieuse.\n\nL'autonomie est importante pour moi car elle me permet de gérer efficacement mon travail, de prendre des décisions éclairées et de fournir des résultats de qualité. En étant autonome, je suis en mesure de gérer mon temps de manière efficace, de prioriser les tâches, de résoudre les problèmes de manière proactive et de prendre des décisions informées lorsque cela est nécessaire.\n\nPar exemple, j'ai récemment été chargé d'un projet complexe qui nécessitait une gestion autonome de bout en bout. J'ai réussi à planifier et à organiser les différentes étapes du projet de manière efficace, en utilisant mes compétences d'analyse et de résolution de problèmes pour surmonter les obstacles et atteindre les objectifs fixés. J'ai été félicité pour ma capacité à prendre des décisions judicieuses et à maintenir un haut niveau de qualité malgré les défis rencontrés.\n\nMon niveau de maîtrise de la compétence d'autonomie est élevé, car j'ai démontré à plusieurs reprises ma capacité à travailler de manière indépendante et à fournir des résultats satisfaisants. Cependant, je reste ouvert aux opportunités d'apprentissage et d'amélioration continue, car il y a toujours des moyens de renforcer et d'affiner cette compétence.\n\nDans mon projet personnel et professionnel, l'autonomie occupe une place centrale. Je cherche constamment à développer mes compétences en gestion autonome, en mettant l'accent sur la planification stratégique, la prise de décision éclairée et la gestion proactive des tâches. Je suis également engagé à partager mes connaissances et mon expérience en matière d'autonomie avec mes collègues et à les encourager à cultiver leur propre autonomie pour une plus grande efficacité et un meilleur rendement.",
  "proficiencyHumanTitle3": "Gestion de Projet",
  "proficiencyHumanText3": "La gestion de projet est une compétence fondamentale dans le domaine professionnel, qui englobe l'organisation, la coordination et la supervision de toutes les activités nécessaires pour atteindre un objectif spécifique. Elle implique la planification rigoureuse des tâches, l'allocation efficace des ressources, la gestion du temps, la communication claire et la capacité à résoudre les problèmes qui peuvent survenir.\n\nLa gestion de projet revêt une importance capitale dans mon contexte professionnel. En tant qu'ingénieur, j'ai souvent été chargé de diriger et de superviser des projets complexes, allant de l'élaboration de logiciels à la mise en œuvre de solutions technologiques. Je suis responsable de l'allocation des ressources, de la définition des objectifs, de l'identification des risques et de la coordination de l'équipe de projet.\n\nPar exemple, j'ai récemment dirigé un projet de mise en place d'un système de gestion de la chaîne d'approvisionnement. J'ai élaboré un plan détaillé, identifié les étapes clés, assigné les tâches aux membres de l'équipe et surveillé l'avancement du projet. Grâce à une gestion efficace, le projet a été livré dans les délais impartis et a répondu aux attentes du client.\n\nMon niveau de maîtrise de la compétence de gestion de projet est élevé, car j'ai acquis une solide expérience dans la gestion de projets complexes et dans la résolution des problèmes qui y sont associés. J'ai une bonne compréhension des méthodologies de gestion de projet telles que le modèle en cascade ou la méthode agile, et je suis en mesure d'appliquer les bonnes pratiques adaptées à chaque situation.\n\nDans mon bilan critique, je reconnais que la gestion de projet est une compétence en constante évolution. Bien que j'aie réussi de nombreux projets, il y a toujours des leçons à tirer et des opportunités d'amélioration. Je continue d'approfondir mes connaissances en gestion de projet en participant à des formations, en suivant les tendances du domaine et en partageant mes expériences avec d'autres professionnels.\n\nDans mon projet personnel et professionnel, la gestion de projet occupe une place centrale. Je prévois de continuer à développer mes compétences en gestion de projet en acquérant de l'expérience dans des projets de plus grande envergure et en prenant des responsabilités de gestion accrues. Je suis également intéressé par l'obtention de certifications reconnues en gestion de projet pour renforcer ma crédibilité et mes compétences dans ce domaine.",

  "proficiencyTechnicalTitle1": "Développeur Full Stack",
  "proficiencyTechnicalText1": "Le développement Full Stack est une compétence clé dans le domaine professionnel de la programmation, qui consiste à maîtriser à la fois le développement côté client (front-end) et le développement côté serveur (back-end). Cela implique d'avoir une compréhension approfondie des technologies, des langages de programmation et des frameworks utilisés dans les deux domaines.\n\nEn tant que développeur Full Stack, je suis capable de créer des applications web complètes, de la conception de l'interface utilisateur à la mise en place des fonctionnalités côté serveur. Je suis à l'aise avec les langages tels que HTML, CSS et JavaScript pour le front-end, ainsi que des langages comme Python, Ruby ou Java pour le back-end. Je maîtrise également des frameworks populaires tels que React, Angular, Node.js ou Django.\n\nLa compétence de développeur Full Stack est essentielle dans mon contexte professionnel, car elle me permet d'être polyvalent et de travailler sur des projets variés. En étant capable de gérer à la fois la partie front-end et la partie back-end d'une application, je suis en mesure de collaborer efficacement avec les membres de l'équipe, de comprendre les besoins des utilisateurs et de mettre en œuvre des solutions complètes.\n\nPar exemple, j'ai récemment travaillé sur un projet de développement d'une plateforme d'e-commerce. En tant que développeur Full Stack, j'ai été responsable de la création de l'interface utilisateur attrayante et réactive, ainsi que de la mise en place des fonctionnalités de gestion des produits, des paiements et des commandes côté serveur. Grâce à ma maîtrise des technologies front-end et back-end, j'ai pu offrir une expérience utilisateur fluide et fonctionnelle.\n\nMon niveau de maîtrise de la compétence de développeur Full Stack est élevé, car j'ai acquis une expérience significative dans la création d'applications web complètes. J'ai participé à plusieurs projets où j'ai pu mettre en pratique mes compétences en développement front-end et back-end, ainsi qu'en intégration de différentes technologies.\n\nDans mon bilan critique, je reconnais que le domaine du développement Full Stack est en constante évolution. Il est essentiel de rester à jour avec les dernières technologies et les tendances émergentes pour continuer à fournir des solutions innovantes. Je suis ouvert à l'apprentissage continu et je cherche régulièrement des occasions d'améliorer mes compétences et d'explorer de nouvelles technologies.\n\nDans mon projet personnel et professionnel, la compétence de développeur Full Stack occupe une place centrale. Je prévois de continuer à développer mes compétences en explorant de nouvelles technologies, en travaillant sur des projets complexes et en collaborant avec des professionnels du domaine. Je suis également intéressé par l'approfondissement de mes connaissances dans des domaines spécifiques, tels que l'intelligence artificielle, la cybersécurité ou la réalité virtuelle, pour élargir mes perspectives en tant que développeur Full Stack.",
  "proficiencyTechnicalTitle2": "Développeur en Business Intelligence",
  "proficiencyTechnicalText2": "Le développement en Business Intelligence (BI) est une compétence essentielle dans le domaine professionnel de l'analyse de données, qui consiste à collecter, traiter et transformer des données brutes en informations significatives et exploitables pour les décisions stratégiques. En tant que développeur en BI, je suis en mesure de concevoir et de mettre en œuvre des solutions technologiques pour l'analyse et la visualisation des données.\n\nLa compétence de développeur en Business Intelligence revêt une grande importance dans mon contexte professionnel, car elle permet d'exploiter le potentiel des données pour prendre des décisions éclairées. En utilisant des outils tels que les entrepôts de données, les ETL (Extract, Transform, Load), les tableaux de bord et les rapports, je suis en mesure de transformer les données en informations visuelles et compréhensibles, facilitant ainsi la prise de décisions basée sur des faits.\n\nPar exemple, j'ai récemment travaillé sur un projet de BI visant à aider une entreprise à optimiser ses processus de production. J'ai extrait les données pertinentes à partir de différentes sources, les ai nettoyées et les ai structurées dans un entrepôt de données. Ensuite, j'ai développé des tableaux de bord interactifs qui permettaient aux utilisateurs de suivre et d'analyser les performances des différentes étapes de production en temps réel. Cette solution a permis à l'entreprise de prendre des décisions rapides et informées pour améliorer son efficacité opérationnelle.\n\nMon niveau de maîtrise de la compétence de développeur en Business Intelligence est élevé, car j'ai une solide expérience dans la conception et la mise en œuvre de solutions de BI. J'ai travaillé avec différents outils et technologies tels que Power BI, Tableau, SQL, Python, ainsi que des techniques d'exploration de données et de modélisation. Je suis capable de comprendre les besoins des utilisateurs, de concevoir des solutions adaptées et de transformer les données en informations exploitables.\n\nDans mon bilan critique, je reconnais que le domaine de la Business Intelligence est en constante évolution, avec l'émergence de nouvelles technologies et de nouvelles approches d'analyse de données. Il est important de rester à jour avec les dernières tendances et les meilleures pratiques pour fournir des solutions efficaces et innovantes. Je suis motivé pour continuer à développer mes compétences en participant à des formations, en explorant de nouvelles technologies et en partageant mes connaissances avec d'autres professionnels.\n\nDans mon projet personnel et professionnel, la compétence de développeur en Business Intelligence joue un rôle central. Je prévois de continuer à approfondir mes connaissances dans le domaine en suivant des formations spécialisées et en travaillant sur des projets de plus grande envergure. Je suis également intéressé par l'intégration de l'intelligence artificielle et de l'apprentissage automatique dans les solutions de BI, afin de tirer parti de leur potentiel pour des analyses plus avancées et des prévisions plus précises.",
  "proficiencyTechnicalTitle3": "Développeur d'Intelligence Artificielle",
  "proficiencyTechnicalText3": "Le développement d'Intelligence Artificielle (IA) est une compétence cruciale dans le domaine professionnel de l'automatisation des processus et de l'amélioration de l'efficacité opérationnelle des entreprises. En tant que développeur d'IA, je suis capable de concevoir, développer et déployer des solutions basées sur l'IA pour résoudre des problèmes complexes et prendre des décisions intelligentes.\n\nLa compétence de développeur d'IA est d'une grande importance dans mon contexte professionnel, car elle permet aux entreprises de tirer parti des avantages de l'automatisation et de l'apprentissage automatique pour optimiser leurs processus et obtenir des résultats plus précis et efficaces. En utilisant des technologies telles que Python, TensorFlow, PyTorch et Pandas, je suis en mesure de développer des modèles d'apprentissage automatique, de traiter de grandes quantités de données et de créer des systèmes intelligents capables d'apprendre et d'évoluer.\n\nPar exemple, j'ai récemment travaillé sur un projet d'IA visant à automatiser la classification des documents dans une entreprise. J'ai développé un modèle d'apprentissage automatique basé sur des réseaux neuronaux profonds qui était capable de lire et de classer automatiquement les documents en fonction de leur contenu. Cela a permis à l'entreprise de gagner un temps précieux en évitant la tâche manuelle de classification et en améliorant l'efficacité de ses opérations.\n\nMon niveau de maîtrise de la compétence de développeur d'IA est élevé, car j'ai acquis une solide expérience dans la conception, le développement et le déploiement de solutions d'IA. J'ai une bonne compréhension des concepts d'apprentissage automatique et des techniques avancées telles que les réseaux neuronaux, les algorithmes de traitement du langage naturel et la vision par ordinateur. Je suis capable de mettre en œuvre des modèles d'IA, de les entraîner sur des ensembles de données et d'évaluer leurs performances.\n\nDans mon bilan critique, je reconnais que le domaine de l'IA est en constante évolution, avec de nouvelles avancées technologiques et de nouvelles approches émergentes. Il est essentiel de rester à jour avec les dernières recherches et les meilleures pratiques pour fournir des solutions d'IA de haute qualité. Je suis passionné par l'apprentissage continu et je m'efforce de rester à jour en suivant des formations, en lisant des articles et en participant à des projets d'IA.\n\nDans mon projet personnel et professionnel, la compétence de développeur d'IA joue un rôle central. Je prévois de continuer à développer mes compétences en IA en travaillant sur des projets plus complexes, en explorant de nouvelles techniques et en collaborant avec d'autres experts du domaine. Je suis également intéressé par l'intégration de l'IA dans d'autres domaines, tels que l'Internet des objets (IoT) ou la robotique, pour créer des solutions innovantes et transformer les industries.",





  "aboutMe": "À propos de moi",
  "aboutMeText": "Je m'appelle Benjamin Payet, actuellement étudiant en 5ème année d'Ingénierie logicielle à INTECH Paris, je suis à la recherche d'une alternance de 6 mois à partir de mars pour finaliser mes études. Dynamique, curieux et persévérant, je m'investis pleinement dans mes projets. J'ai acquis une solide expérience en développement logiciel grâce à diverses expériences professionnelles, notamment en tant que développeur full-stack pour le groupe ESIEA, stagiaire en développement d'outils Dashboard chez Thales GTS, et assistant ingénieur études et développement en alternance chez DEGETEL. Mes compétences techniques incluent la maîtrise de divers langages de programmation et technologies tels que VueJS, JavaScript, MySQL, HTML, CSS, C#, Python, C++ et PHP. J'ai également travaillé sur plusieurs projets informatiques, tels que Trip Over Time, un jeu de type Mario en 2D réalisé en C#, et MyPerfectList, un site web permettant de gérer toutes ses watchlists via les APIs de MyAnimeList, IMDb, Goodreads, et d'autres. En plus de ma passion pour l'informatique, je suis un fervent amateur de musique, jouant de la guitare et du piano depuis 9 ans. J'aime également la lecture (scientifique, informatique, policière, fantastique, science-fiction) et les jeux vidéo (FPS, RPG, jeux multijoueurs, aventure). Dans le cadre de projets de formation humaine, j'ai participé à des actions bénévoles telles que Sept de Coeur, où j'ai donné des cours de français, anglais et informatique à des personnes démunies avec l'association Coeur du Cinq, et InGame, où j'ai organisé un tournoi de jeux vidéo en ligne pendant le confinement. Je parle couramment l'anglais et ai obtenu un score de 100/120 au TOEFL. Ayant étudié la Licence pro commerce international à l'Université Paris Descartes et le BTS Management des Unités Commerciales (MUC) au Lycée de Bras Fusil à la Réunion, j'ai également une solide formation en commerce et management. N'hésitez pas à me contacter pour discuter de mes compétences et de vos besoins. Je suis convaincu que mon profil et mon expérience peuvent être un atout pour votre entreprise.",
  "jobTitle": "Ingénieur Logiciel",
  "aboutMenu": "À propos",
  "homeMenu": "Accueil",
  "portfolioMenu": "Réalisations",
  "contactMenu": "Contact",
  "articlesMenu": "Compétences",
  "article1Title": "Mise en Place d'Indicateurs de Performance Automatisés",
  "article1Summary": "article1Summary",
  "article1Text": "Lorsque j'ai rejoint Thales en tant qu'ingénieur logiciel, je me suis trouvé dans un environnement où les données nécessaires au suivi du travail des équipes étaient dispersées sur plusieurs plateformes, notamment Jira, Excel et Salesforce. La diversité des sources de données et la nécessité d'un suivi consolidé et efficace pour le SCRUM Master ont présenté à la fois un défi et une opportunité. \n\n  L'enjeu principal était d'améliorer l'efficacité opérationnelle et la productivité des équipes. Le défi pour moi résidait dans l'intégration harmonieuse de ces différentes plateformes et dans la manipulation des données en conséquence. J'étais également conscient des risques associés, notamment les éventuelles difficultés d'intégration de toutes ces sources et la complexité des outils.  Je me suis alors lancé dans un projet ambitieux : créer un tableau de bord automatisé consolidant les données de tous ces outils. L'objectif était de fournir au SCRUM Master une vue unifiée des performances de l'équipe, tout en identifiant les domaines nécessitant des améliorations.  Au cours des trois mois suivants, j'ai mis en place des scripts pour extraire les données de chaque plateforme, avant de développer des mécanismes pour automatiser le processus. Parallèlement, j'ai conçu le tableau de bord selon les besoins du SCRUM Master. Cette réalisation a exigé de moi une connaissance approfondie des outils, une aptitude à gérer des données de sources diverses et une compétence en automatisation.  En fin de compte, l'effort a porté ses fruits. Les tableaux de bord automatisés ont permis d'améliorer la visibilité du travail de l'équipe pour le SCRUM Master, facilitant ainsi la prise de décisions. Sur le plan personnel, j'ai acquis une expérience précieuse en matière de manipulation de données et d'automatisation.  Au-delà du projet, la mise en place de ces tableaux de bord a conduit à des gains de temps significatifs et à une prise de décision plus éclairée, apportant une valeur ajoutée à Thales. Pour ma part, j'ai pu renforcer mon expertise en matière de gestion de données et d'automatisation, ce qui a indéniablement enrichi mon profil d'ingénieur logiciel.  Aujourd'hui, je regarde ce projet avec un sentiment de fierté. J'ai appris l'importance de l'automatisation et comment elle peut améliorer l'efficacité opérationnelle. Si je devais entreprendre un projet similaire à l'avenir, je chercherais à impliquer davantage les utilisateurs finaux dès le début, afin de mieux comprendre leurs besoins et d'adapter en conséquence les solutions que je développe.",
  "article2Title": "Révolution dans la Prédiction des Performances : Mon Expérience avec le Machine Learning dans la prévison des performances de projet",
  "article2Summary": "article2Summary",
  "article2Text": "Chez Degetel, une entreprise de services numériques réputée, j'ai eu l'occasion de plonger dans l'univers complexe de la prévision des performances de projet. Avec une multitude de facteurs variables à considérer, prédire l'avenir devenait un défi grandissant. Mais c'était un défi que j'étais prêt à relever.\n\nConvaincu de l'efficacité du machine learning dans le traitement de ces situations complexes, j'ai décidé d'utiliser mes compétences en Python pour créer des modèles prédictifs. J'étais animé par l'idée de faciliter la fixation d'objectifs pour les futurs projets et d'améliorer ainsi l'efficacité opérationnelle de Degetel.\n\nAprès des semaines de développement, de tests et d'optimisation, mes modèles étaient prêts à être déployés. J'ai utilisé la plateforme Google Cloud pour créer des tableaux de bord interactifs, permettant une visualisation claire des prévisions générées par mes modèles.\n\nLe succès de cette initiative a dépassé nos attentes. Les tableaux de bord ont non seulement permis une meilleure compréhension des performances de projet, mais ils ont aussi amélioré la transparence et l'efficacité de la prise de décisions. De mon côté, cette expérience m'a permis d'approfondir mes compétences en machine learning et en Python, et de me familiariser davantage avec Google Cloud Platform.\n\nAu-delà de l'impact positif immédiat sur Degetel, ce projet a eu des répercussions durables. La planification et la gestion des projets se sont améliorées, et j'ai acquis une précieuse confiance en moi, qui m'a servi dans d'autres projets ultérieurs.\n\nAvec du recul, je regarde cette expérience avec fierté. J'ai appris qu'avec les bons outils et une approche réfléchie, nous pouvons transformer les défis en opportunités et les données brutes en informations précieuses. Avec du recul, je chéris cette expérience comme un jalon significatif dans ma carrière. Non seulement j'ai eu l'opportunité d'appliquer mes compétences en machine learning à une problématique réelle, mais j'ai également contribué à transformer la prise de décision chez Degetel. Si je devais revisiter un projet de ce genre, je mettrais un accent encore plus fort sur la collaboration avec les utilisateurs pour maximiser la valeur des prédictions et adapter davantage les modèles à leurs besoins spécifiques.",
  "article3Title": "Création d'un Site Interne Améliorant l'Efficacité Administrative",
  "article3Summary": "article3Summary",
  "article3Text": "Lorsque j'étais à l'ESIEA, une école d'ingénieurs réputée, j'ai eu l'opportunité de travailler sur un projet passionnant. Il s'agissait de développer un site interne pour le personnel administratif, dans le cadre de l'ERP sur lequel je travaillais. Ce site devait faciliter l'accès à la liste des étudiants et améliorer les opérations administratives.\n\nLe projet s'inscrivait dans un double objectif. D'une part, il s'agissait d'améliorer l'efficacité du personnel administratif en rationalisant l'accès à l'information. D'autre part, je devais veiller à ce que le site réponde aux normes ISO, une exigence importante pour l'école.\n\nDans ce contexte, j'ai conçu le site en veillant à ce qu'il réponde aux besoins spécifiques de l'équipe administrative. J'ai créé une interface où le personnel pouvait accéder facilement à la liste des étudiants, cliquer sur le profil d'un étudiant pour obtenir plus d'informations, exporter les données en formats XLSX ou DOCX selon les besoins et générer des fiches ISO automatiquement.\n\nLe développement du site a pris plusieurs semaines et a impliqué de nombreuses étapes, allant de la conception de l'interface à l'intégration de différentes fonctionnalités et à l'assurance qualité. Le plus grand défi était de créer un outil qui soit à la fois facile à utiliser et conforme aux normes ISO.\n\nLes retours ont été très positifs. Le personnel administratif a trouvé le site extrêmement utile, et le temps nécessaire pour accomplir certaines tâches a été réduit. Le respect des normes ISO a également été assuré, ce qui a contribué à renforcer l'image de l'école.\n\nSur le plan personnel, ce projet m'a permis de renforcer mes compétences en développement web et en gestion de projets. J'ai également appris à travailler avec les normes ISO, ce qui s'est avéré très utile par la suite.\n\nEn regardant en arrière, je suis fier de cette réalisation. Non seulement elle a apporté une valeur tangible à l'école, mais elle m'a aussi permis d'acquérir des compétences précieuses. En réfléchissant à cette réalisation, je suis fier de l'impact tangible de mon travail. Le site que j'ai développé a non seulement simplifié les tâches administratives, mais a également renforcé la conformité de l'école aux normes ISO. Sur le plan personnel, cette expérience a renforcé ma prise de conscience de l'importance d'un développement centré sur l'utilisateur et du respect des normes. Si une opportunité similaire se présentait à nouveau, j'investirais davantage de temps dans la recherche de bibliothèques JavaScript existantes. Cela aurait probablement permis de simplifier le processus de développement et d'accélérer la livraison du produit.",

  "project1title": "Développeur Full Stack",
  "project1description": "Développement de back-end et de front-end pour différentes applications web, y compris des sites web et des applications de gestion de contenu. Utilisation de technologies telles que NodeJS, Express, TailwindCSS, différents frameworks JS tels que VueJS/Angular/React/SolidJS, des base de données MongoDB ou MariaDB/MySQL",
  "project2title": "Développeur en Business Intelligence",
  "project2description": "Développement de solutions de Business Intelligence pour aider les entreprises à prendre des décisions plus éclairées. Utilisation de technologies telles que Power BI/GCP/Tableau, Python, SQL et NoSQL.",
  "project3title": "Développeur d'Intelligence Artificielle",
  "project3description": "Développement de solutions d'IA pour aider les entreprises à automatiser les processus et à améliorer l'efficacité opérationnelle. Utilisation de technologies telles que Python, TensorFlow, PyTorch, Pandas",
  "backToTop": "Retour en haut",
  "footer": "Benjamin Payet. Tous droits réservés.",
  "portfolioproject1title": "MyPerfectList",
  "portfolioproject1text": "MyPerfectList est une Plateforme WEB regroupant différentes collections existantes (IMDb, MAL, etc) et permettant d'en créer d'autres accessible à tous en ayant pour but de centraliser les données des utilisateurs de ses differents sites. Elle permettra donc de ne plus avoir besoin d'utiliser plusieurs liens vers plusiseurs sites differents afin de connaitre les gouts d'une personne et de pouvoir avoir une vue d'ensemble de tous les sites de base de données auquel l'utilisateur est membre ainsi que de voir ses listes personnalisés.",
  "portfolioproject2title": "Trip Over Time",
  "portfolioproject2text": "\"Trip Over Time\" (T.O.T) est un jeu d'aventure en 2D où les joueurs naviguent à travers le temps : le passé Viking dans \"Skyrim\", l'Amazonie actuelle dans \"Mowgli\", et un futur infesté de zombies dans \"Paradise\". Chaque niveau présente des ennemis et des défis uniques, avec un boss important à la fin. Le gameplay implique des commandes de base au clavier et à la souris, tandis que les effets sonores sont créativement conçus par les membres de l'équipe. Le jeu propose des modes multijoueurs potentiels, des mini-jeux, des boosts de progression, et la compatibilité avec les contrôleurs, promettant un gameplay diversifié et immersif.",
  "portfolioproject3title": "ERP ESIEA",
  "portfolioproject3text": "Dans le cadre de mon expérience professionnelle, j'ai mené un projet de développement d'un ERP pour l'ESIEA, en utilisant Go pour le backend et VueJS pour le front. Cette initiative a permis de mettre en œuvre des solutions performantes et efficaces pour la gestion des différentes tâches administratives. J'ai notamment été en charge de la conception du module de gestion des étudiants, qui permet un suivi détaillé et personnalisé de chaque élève. La migration des données de l'ancien ERP vers le nouveau a été un véritable défi en raison de la complexité et de la quantité de données à traiter. Cependant, grâce à une analyse approfondie et une planification minutieuse, j'ai réussi à effectuer la migration sans perte de données et dans les délais impartis. Ce projet m'a permis de renforcer mes compétences en programmation Go et VueJS, et de me familiariser avec la gestion de projets d'envergure.",
  "myValues": "Mes Valeurs",
  "myValuesText": "En tant que professionnel dans le domaine de l'informatique et du développement de logiciels, j'accorde une grande importance à l'éthique, l'intégrité, et la persévérance. Je suis très curieux, toujours prêt à apprendre de nouvelles technologies et à relever de nouveaux défis. J'estime que le respect mutuel et l'esprit d'équipe sont essentiels pour la réussite de tout projet.",
  "myProject": "Mon Projet Professionnel",
  "myProjectText": "Mon objectif professionnel est de continuer à développer mes compétences techniques en tant que développeur Full-Stack, et éventuellement d'évoluer vers un poste de lead développeur ou d'architecte logiciel. Je souhaite travailler sur des projets innovants et techniquement stimulants, qui me permettront de continuer à apprendre et à me développer en tant que professionnel de l'informatique. En parallèle, je suis également passionné par la musique et les jeux vidéo, et j'aimerais à terme pouvoir associer mes compétences techniques à ces centres d'intérêt pour développer des projets personnels dans ces domaines.",
  "myHumanQualities": "Mes Qualités Humaines",
  "myHumanQualitiesText": "Ma motivation, mon investissement personnel et ma persévérance sont des atouts majeurs dans le cadre de mes missions professionnelles. J'apprécie le travail en équipe, et je suis capable de faire preuve de leadership quand cela est nécessaire. Je suis également doté d'une grande capacité d'adaptation, ce qui me permet de me retrouver rapidement à l'aise dans de nouveaux environnements ou face à de nouvelles technologies. Par ailleurs, ma curiosité naturelle m'incite constamment à apprendre et à explorer de nouveaux domaines, que ce soit dans le cadre professionnel ou personnel.",
  "myHobbies": "Mes Loisirs",
  "myHobbiesText": "Mes centres d'intérêt principaux sont la musique et les jeux vidéo. Je pratique la guitare et le piano depuis près de dix ans, et j'ai un goût prononcé pour les jeux vidéo de genres variés comme les FPS, RPG et jeux multijoueur. Je suis également un grand lecteur, avec une prédilection pour les ouvrages scientifiques, informatiques, policiers, de fantaisie et de science-fiction. Ces centres d'intérêt enrichissent ma vie personnelle, mais contribuent également à stimuler ma créativité et mon esprit d'innovation dans ma vie professionnelle."
}
