{
  "name": "Benjamin Payet",
  "downloadResume": "Télécharger le CV",
  "personalInformation": "Informations personnelles",
  "whoIAm": "Qui suis-je ?",
  "revealContactDetails": "Révéler les détails de contact",
  "phoneNumberName": "Téléphone",
  "emailName": "Email",
  "emailAddress": "Adresse e-mail",
  "locationName": "Localisation",
  "location": "Ile de France, France",
  "birthdayName": "Date de naissance",
  "birthday": "05 Août 1998",
  "whatIDo": "Ce que je fais!",
  "resumeMenu": "Mon parcours",
  "resume": "CV",
  "all": "Tout",
  "proficiencyHuman": "Compétences humaines",
  "proficiencyTechnical": "Compétences techniques",
  "contactMe": "Contactez-moi",
  "contactMePart1": "Si vous avez des questions ou si vous souhaitez simplement discuter, n'hésitez pas à ",
  "contactMePart2": "me contacter",
  "nameEmailForm": "Nom",
  "email": "Email",
  "message": "Message",
  "submit": "Envoyer",
  "workingSkills": "Compétences professionnelles",
  "knowledge": "Connaissances",
  "education": "Formation",
  "experience": "Expérience",
  "intech": "INTECH Paris (Groupe ESIEA)",
  "intechDescription": "Master en ingienerie logicielle",
  "commercialLicense": "Université Paris Descartes",
  "commercialLicenseDescription": "Licence professionnelle en commerce international",
  "bts": "Lycée de Bras Fusil (La Réunion)",
  "btsDescription": "BTS Management des Unités Commerciales (MUC)",
  "Lycee": "Lycée Amiral Pierre Bouvet (La Réunion)",
  "LyceeDescription": "Baccalauréat Scientifique option SVT mention Bien",
  "Invivo": "Invivo France – Développeur Full-Stack",
  "InvivoDescription": "Développement d'une application web de gestion de données et de reporting",
  "ESIEA": "Groupe Esiea – Alternance en tant que\nDéveloppeur Full-Stack (18 mois)",
  "ESIEADescription": "Utilisation de Go et Quasar/VueJS/Typescript pour\nla création d’un ERP(Enterprise Resource Planning) pour l’école",
  "Thales": "Thales GTS – Stage en tant que\nDéveloppeur d'outils Dashboard (6 mois)",
  "ThalesDescription": "Création d'un outil de reporting pour le suivi des équipes de développement",
  "Degetel": "Degetel – Alternance en tant que\nAssistant Ingénieur Etudes et Développement (12 mois)",
  "DegetelDescription": "Utilisation de Salesforce, MySQL, Matlab et Google\nCloud Platform afin d’optimiser la direction de\nl’entreprise",

  "proficiencyHumanTitle1": "Curiosité",
  "proficiencyHumanText1": "%%Importance de la curiosité%%\n\nLa curiosité est plus qu'une compétence, c'est une philosophie de vie dans le domaine professionnel, une quête intarissable de connaissances et une envie brûlante de dévoiler l'inconnu. Elle éveille en moi l'audace de questionner, la liberté d'explorer des perspectives hors des sentiers battus, et la ferveur de chasser des solutions avant-gardistes.\n\n%%Nourrir la curiosité%%\n\nPour moi, la curiosité est un carburant essentiel, stimulant ma créativité et renforçant mes aptitudes à résoudre des énigmes de tous ordres. Grâce à elle, je navigue avec aisance entre diverses disciplines, élargissant ainsi ma compréhension et ma contribution aux projets. La curiosité m'a conduit à embrasser la complexité du domaine technologique, apprivoisant des outils innovants comme Python, Docker, et les réseaux neuronaux.\n\n%%Démonstration de la curiosité%%\n\nRécemment, j'ai plongé dans un cours en ligne sur les technologies émergentes, ouvrant de nouvelles perspectives et enrichissant mon arsenal de compétences. Mes propositions lors des réunions d'équipe reflètent mes recherches proactives et une approche qui ose penser autrement, à l'image d'un musicien qui joue une mélodie inédite sur une guitare bien accordée.\n\nMa curiosité ne se limite pas à mon terrain professionnel. Elle me pousse à explorer d'autres domaines comme la musique, où j'apprends la guitare en autodidacte, ou l'histoire, une passion qui me permet d'éclairer le présent à la lumière du passé.\n\nMon appétit de connaissances est insatiable, et je suis toujours à la recherche de nouvelles aventures intellectuelles pour affiner mon approche professionnelle. Je suis convaincu que l'évolution est un processus continu et que la curiosité est une clé pour ouvrir de nouvelles portes. Je suis excité à l'idée d'explorer de nouvelles contrées, d'apprendre de nouvelles compétences, et de repousser sans cesse les limites de mon horizon professionnel.",
  "proficiencyHumanTitle2": "Autonomie",
  "proficiencyHumanText2": "%%Redéfinir l'autonomie: Aller au-delà de soi-même%%\n\nDans le monde professionnel, l'autonomie transcende la simple capacité à prendre des initiatives ou à travailler de façon indépendante. Elle est caractérisée par la faculté à dépasser ses propres limites pour se mettre au service des autres, en négociant, déléguant et facilitant leur autonomie. C'est un exercice constant de planification, d'organisation, de prise de décisions éclairées, mais aussi de promotion de l'autonomie au sein de son équipe.\n\n%%Les avantages d'une autonomie partagée%%\n\nLa nouvelle définition de l'autonomie m'est précieuse car elle nourrit un environnement collaboratif, efficace et empreint d'innovation. En négociant et déléguant, je peux gérer mon temps de manière efficiente, tout en encourageant la responsabilité et la prise d'initiative chez mes collègues. En outre, en aidant les autres à devenir autonomes, je contribue à la qualité des résultats et à la capacité d'adaptation de l'ensemble de l'équipe.\n\n%%Application pratique de l'autonomie%%\n\nPour illustrer cela, j'ai récemment été chargé d'un projet d'envergure, qui nécessitait non seulement de la gestion autonome, mais également de la coordination et de la collaboration. J'ai planifié et organisé les différentes étapes, tout en déléguant certaines tâches à des collègues compétents, afin de promouvoir leur autonomie. Mon approche a non seulement permis de surmonter les défis, mais également de favoriser une atmosphère de coopération et de croissance personnelle au sein de l'équipe.\n\nMon niveau de compétence en autonomie est élevé, non pas seulement parce que je peux travailler seul, mais surtout parce que je sais comment favoriser l'autonomie chez les autres. Je reste cependant ouvert à l'apprentissage et à l'amélioration continue, car perfectionner cette compétence est un voyage sans fin.\n\nL'autonomie n'est pas qu'un simple outil de gestion personnel. Elle s'infiltre dans chaque aspect de ma vie professionnelle, où je m'efforce de promouvoir l'autonomie parmi mes collègues et d'établir une culture d'efficacité collaborative. Mon engagement va au-delà de ma propre productivité: il est de faire de l'autonomie une force commune qui propulse notre travail vers de nouveaux sommets.",
  "proficiencyHumanTitle3": "Gestion de projet",
  "proficiencyHumanText3": "%%L'importance de la gestion de projet%%\n\nLa gestion de projet est une compétence essentielle dans le domaine professionnel, englobant l'organisation, la coordination et la supervision de toutes les activités nécessaires pour atteindre un objectif spécifique. Elle implique une planification approfondie du projet, une allocation efficace des ressources, la gestion du temps, une communication claire et la capacité à résoudre les problèmes qui peuvent survenir.\n\n%%Compétence en gestion de projet%%\n\nLa gestion de projet revêt une importance cruciale dans mon contexte professionnel. En tant qu'ingénieur, on m'a souvent confié la responsabilité de diriger et de gérer des projets complexes, allant du développement de logiciels à la mise en œuvre de solutions techniques. Je suis responsable de l'allocation des ressources, de la définition des objectifs, de l'identification des risques et de la coordination de l'équipe de projet.\n\n%%Évolution de la compétence en gestion de projet%%\n\nPar exemple, j'ai récemment dirigé un projet visant à mettre en place un système de gestion de la chaîne d'approvisionnement. J'ai élaboré un plan complet, identifié les étapes clés, attribué des tâches aux membres de l'équipe et suivi l'avancement du projet. Grâce à une gestion efficace, le projet a été livré dans les délais spécifiés et a répondu aux attentes du client.\n\nMon niveau de compétence en gestion de projet est élevé, car j'ai acquis une expérience considérable dans la gestion de projets complexes et la résolution des défis associés. Je comprends bien les méthodologies de gestion de projet telles que le modèle en cascade et l'approche agile, et je peux appliquer les meilleures pratiques adaptées à chaque situation.\n\nEn prenant du recul, je réalise que la gestion de projet est un voyage, pas une destination. Même si j'ai atteint des sommets dans divers projets, je sais qu'il y a toujours de nouvelles montagnes à gravir et de nouvelles leçons à apprendre. C'est pourquoi, je continue d'affiner mes compétences en gestion de projet en suivant des formations, en restant au fait des tendances de l'industrie et en échangeant avec d'autres voyageurs de la gestion de projet.\n\nLa gestion de projet est plus qu'une compétence pour moi, c'est un mode de vie qui s'étend à mes activités personnelles et professionnelles. Mon plan pour l'avenir ? Rester dans la cour des grands de la gestion de projet, en plongeant dans des projets de plus grande envergure et en acceptant des responsabilités de gestion de plus en plus conséquentes. De plus, l'obtention de certifications reconnues en gestion de projet est sur ma liste de choses à faire, afin de cimenter ma réputation et d'affiner encore plus mes compétences dans ce domaine.",


  "proficiencyTechnicalTitle1": "Développeur Full Stack",
  "proficiencyTechnicalText1": "%%L'essence du développement Full Stack%%\n\nLe développement Full Stack, ce n'est pas seulement ma compétence, c'est mon état d'esprit. Immergé dans le paysage varié de la programmation, je jongle habilement entre front-end et back-end, avec une compréhension intime des technologies, des langages de programmation et des frameworks qui meublent ces deux univers.\n\n%%L'art de la polyvalence et du partenariat%%\n\nEn tant que développeur Full Stack, je ne me contente pas de construire des applications web : je leur donne vie. Du façonnage de l'interface utilisateur à l'orchestration des fonctionnalités côté serveur, ma palette de compétences couvre une gamme de langages tels que HTML, CSS, JavaScript, Python, Ruby, et Java. Sans oublier ma maîtrise de frameworks comme React, Angular, Node.js et Django, qui sont des alliés incontournables.\n\n%%Competence et quête perpétuelle de savoir%%\n\nLe mantra du développeur Full Stack que je suis ? L'adaptabilité. Être en mesure de gérer les facettes front-end et back-end d'une application me permet de collaborer efficacement avec les autres membres de l'équipe, de cerner les attentes des utilisateurs et de mettre en place des solutions à 360°. Le développement Full Stack n'est pas une destination, mais un voyage perpétuel vers de nouvelles conquêtes technologiques.\n\nJ'ai récemment dirigé le développement d'une plateforme de commerce électronique, orchestrant à la fois la création d'une interface utilisateur attrayante et réactive et le développement des fonctionnalités back-end. Mon expertise Full Stack m'a permis d'offrir une expérience utilisateur fluide et engageante.\n\nAvec un bagage riche de nombreux projets et de technologies intégrées, ma quête de savoir ne s'arrête jamais. Le développement Full Stack est un monde en constante évolution, et rester au fait des dernières avancées est une nécessité pour continuer à innover.\n\n%%Vers l'horizon et au-delà : l'avenir en mouvement%%\n\nDans ce tourbillon technologique, ma curiosité et ma passion me poussent toujours plus loin. Mes projets personnels et professionnels sont un véritable laboratoire d'exploration. Je prévois de plonger dans l'univers passionnant de l'intelligence artificielle, où les perspectives sont aussi vastes que l'horizon. En particulier, je suis fasciné par la possibilité de réaliser des projets de reconnaissance d'émotions dans les vidéos - une fusion entre l'humain et la machine qui promet d'être révolutionnaire. Je compte également approfondir mes connaissances dans des domaines spécifiques tels que la cybersécurité et l'IA'. Tous ces objectifs ne sont pas seulement des destinations, mais des voyages qui m'amènent à élargir constamment mes horizons en tant que développeur Full Stack.",

  "proficiencyTechnicalTitle2": "Développeur en Business Intelligence",
  "proficiencyTechnicalText2": "%%Importance du développement en Business Intelligence%%\n\nLe développement en Business Intelligence (BI) est une compétence essentielle dans le domaine professionnel de l'analyse de données, qui consiste à collecter, traiter et transformer les données brutes en informations significatives et exploitables pour la prise de décisions stratégiques. En tant que développeur BI, je suis capable de concevoir et mettre en œuvre des solutions technologiques pour l'analyse et la visualisation des données.\n\n%%Faciliter la prise de décisions éclairées%%\n\nLa compétence d'un développeur en Business Intelligence est d'une grande importance dans mon contexte professionnel, car elle permet d'exploiter le potentiel des données pour prendre des décisions éclairées. En utilisant des outils tels que les entrepôts de données, les ETL (Extract, Transform, Load), les tableaux de bord et les rapports, je suis capable de transformer les données en informations visuelles et compréhensibles, facilitant ainsi la prise de décisions basées sur les faits.\n\n%%Mise en œuvre et amélioration continue%%\n\nPar exemple, j'ai récemment travaillé sur un projet BI visant à aider une entreprise à optimiser ses processus de production. J'ai extrait des données pertinentes de différentes sources, les ai nettoyées et structurées dans un entrepôt de données. J'ai ensuite développé des tableaux de bord interactifs permettant aux utilisateurs de suivre et d'analyser les performances des différentes étapes de production en temps réel. Cette solution a permis à l'entreprise de prendre des décisions rapides et éclairées pour améliorer son efficacité opérationnelle.\n\nMon niveau de maîtrise en tant que développeur en Business Intelligence est élevé, car j'ai une solide expérience dans la conception et la mise en œuvre de solutions BI. J'ai travaillé avec différents outils et technologies tels que Power BI, Tableau, SQL, Python, ainsi que des techniques et des modèles d'extraction de données. Je suis capable de comprendre les besoins des utilisateurs, de concevoir des solutions adaptées et de transformer les données en informations exploitables.\n\nDans ma réflexion critique, je reconnais que le domaine de l'Business Intelligence évolue constamment, avec l'émergence de nouvelles technologies et de nouvelles approches de l'analyse des données. Il est important de se tenir à jour des dernières tendances et meilleures pratiques pour fournir des solutions efficaces et innovantes. Je suis motivé pour continuer à développer mes compétences en participant à des formations, en explorant de nouvelles technologies et en partageant mes connaissances avec d'autres professionnels.\n\nDans mes projets personnels et professionnels, la compétence d'un développeur en Business Intelligence joue un rôle central. Je prévois de continuer à approfondir mes connaissances dans ce domaine en suivant des formations spécialisées et en travaillant sur des projets de plus grande envergure. Je suis également intéressé par l'intégration de l'intelligence artificielle et de l'apprentissage automatique dans les solutions BI, afin de tirer parti de leur potentiel pour des analyses plus avancées et des prévisionsplus précises.",

  "proficiencyTechnicalTitle3": "Développeur en Intelligence Artificielle",
  "proficiencyTechnicalText3": "%%La puissance du développement en Intelligence Artificielle%%\n\nLe développement en Intelligence Artificielle (IA) est une compétence cruciale dans le domaine professionnel de l'automatisation des processus et de l'amélioration de l'efficacité opérationnelle des entreprises. En tant que développeur en IA, je suis capable de concevoir, développer et déployer des solutions basées sur l'IA pour résoudre des problèmes complexes et prendre des décisions intelligentes.\n\n%%Exploiter l'automatisation et l'apprentissage automatique%%\n\nLa compétence d'un développeur en IA est d'une grande importance dans mon contexte professionnel, car elle permet aux entreprises de tirer parti des avantages de l'automatisation et de l'apprentissage automatique pour optimiser leurs processus et obtenir des résultats plus précis et efficaces. En utilisant des technologies telles que Python, TensorFlow, PyTorch et Pandas, je suis capable de développer des modèles d'apprentissage automatique, de traiter de grandes quantités de données et de créer des systèmes intelligents capables d'apprendre et d'évoluer.\n\n%%Compétence et apprentissage continu%%\n\nPar exemple, j'ai récemment travaillé sur un projet d'IA visant à automatiser la classification des documents dans une entreprise. J'ai développé un modèle d'apprentissage automatique basé sur des réseaux neuronaux profonds capable de lire et de classer automatiquement les documents en fonction de leur contenu. Cela a permis à l'entreprise de gagner un temps précieux en évitant la tâche manuelle de classification et en améliorant l'efficacité de ses opérations.\n\nMon niveau de compétence en tant que développeur en IA est élevé, car j'ai acquis une solide expérience dans la conception, le développement et le déploiement de solutions d'IA. J'ai une bonne compréhension des concepts de l'apprentissage automatique et des techniques avancées telles que les réseaux neuronaux, les algorithmes de traitement du langage naturel et la vision par ordinateur. Je suis capable de mettre en œuvre des modèles d'IA, de les entraîner sur des ensembles de données et d'évaluer leurs performances.\n\n",




  "aboutMe": "À propos de moi",
  "aboutMeText": "Je m'appelle Benjamin Payet, actuellement étudiant en 5ème année d'Ingénierie logicielle à INTECH Paris, je suis à la recherche d'une alternance de 6 mois à partir de mars pour finaliser mes études. Dynamique, curieux et persévérant, je m'investis pleinement dans mes projets. J'ai acquis une solide expérience en développement logiciel grâce à diverses expériences professionnelles, notamment en tant que développeur full-stack pour le groupe ESIEA, stagiaire en développement d'outils Dashboard chez Thales GTS, et assistant ingénieur études et développement en alternance chez DEGETEL. Mes compétences techniques incluent la maîtrise de divers langages de programmation et technologies tels que VueJS, JavaScript, MySQL, HTML, CSS, C#, Python, C++ et PHP. J'ai également travaillé sur plusieurs projets informatiques, tels que Trip Over Time, un jeu de type Mario en 2D réalisé en C#, et MyPerfectList, un site web permettant de gérer toutes ses watchlists via les APIs de MyAnimeList, IMDb, Goodreads, et d'autres. En plus de ma passion pour l'informatique, je suis un fervent amateur de musique, jouant de la guitare et du piano depuis 9 ans. J'aime également la lecture (scientifique, informatique, policière, fantastique, science-fiction) et les jeux vidéo (FPS, RPG, jeux multijoueurs, aventure). Dans le cadre de projets de formation humaine, j'ai participé à des actions bénévoles telles que Sept de Coeur, où j'ai donné des cours de français, anglais et informatique à des personnes démunies avec l'association Coeur du Cinq, et InGame, où j'ai organisé un tournoi de jeux vidéo en ligne pendant le confinement. Je parle couramment l'anglais et ai obtenu un score de 100/120 au TOEFL. Ayant étudié la Licence pro commerce international à l'Université Paris Descartes et le BTS Management des Unités Commerciales (MUC) au Lycée de Bras Fusil à la Réunion, j'ai également une solide formation en commerce et management. N'hésitez pas à me contacter pour discuter de mes compétences et de vos besoins. Je suis convaincu que mon profil et mon expérience peuvent être un atout pour votre entreprise.",
  "jobTitle": "Ingénieur Logiciel",
  "aboutMenu": "À propos",
  "homeMenu": "Accueil",
  "portfolioMenu": "Réalisations",
  "contactMenu": "Contact",
  "articlesMenu": "Compétences",


  "article1Title": "Mise en Place d'Indicateurs de Performance Automatisés",
  "article1Summary": "article1Summary",
  "article1Text": "%%Efficacité et Intégration%%\n\nQuand j'ai rejoint Thales en tant que concepteur de logiciels, je me suis retrouvé dans un environnement où les données nécessaires pour suivre le travail de l'équipe étaient dispersées sur plusieurs systèmes, y compris Jira, Excel et Salesforce. La diversité des sources d'information et le besoin d'un suivi consolidé et efficace pour le Scrum Master présentaient à la fois un défi et une opportunité.\n\n%%Création d'un Tableau de Bord Automatisé%%\n\nLa préoccupation principale était d'améliorer l'efficacité opérationnelle et la productivité de l'équipe. Le défi pour moi résidait dans l'intégration sans faille de ces différents systèmes et dans la gestion appropriée de l'information. J'étais également conscient des risques associés, notamment les problèmes d'intégration potentiels de toutes ces sources et la complexité des outils.\n\nJe me suis alors lancé dans un projet ambitieux : créer un tableau de bord automatisé qui consoliderait les données de tous ces outils. L'objectif était de fournir au Scrum Master une vue unifiée des performances de l'équipe, tout en identifiant les domaines nécessitant des améliorations.\n\nAu cours des trois mois suivants, j'ai mis en œuvre des scripts pour extraire les informations de chaque système, puis développé des mécanismes pour automatiser le processus. Parallèlement, j'ai conçu le tableau de bord pour répondre aux exigences du Scrum Master. Cette réalisation nécessitait une compréhension approfondie des outils, la capacité de gérer les données provenant de sources diverses, et un talent pour l'automatisation.\n\nAu final, l'effort a porté ses fruits. Les tableaux de bord automatisés ont amélioré la visibilité du travail de l'équipe pour le Scrum Master, facilitant ainsi la prise de décision. Sur le plan personnel, j'ai acquis une précieuse expérience dans la manipulation des données et l'automatisation.\n\n%%Impact et Réflexions%%\n\nAu-delà du projet, la mise en place de ces tableaux de bord a entraîné des économies de temps significatives et une prise de décision plus éclairée, ajoutant de la valeur à Thales. Pour ma part, j'ai pu renforcer mon expertise en gestion de données et en automatisation, ce qui a indéniablement enrichi mon profil en tant que concepteur de logiciels.\n\nAujourd'hui, je regarde en arrière ce projet avec un sentiment de satisfaction. J'ai appris l'importance de l'automatisation et comment elle peut améliorer l'efficacité opérationnelle. Si je devais entreprendre un projet similaire à l'avenir, je m'efforcerais d'impliquer davantage les utilisateurs finaux dès le départ, afin de mieux comprendre leurs besoins et d'adapter en conséquence les solutions que je développe.\n",
  "article2Title": "Révolution dans la Prédiction de Performance : Mon Expérience avec l'Apprentissage Automatique dans la Prévision de Performance de Projet",
  "article2Summary": "Résumé de l'Article",
  "article2Text": "%%Explorer la prédiction de performance de projet%%\n\nChez Degetel, une entreprise réputée de solutions numériques, j'ai eu l'occasion d'explorer le monde complexe de la prédiction de performance de projet. Avec une multitude d'éléments variables à considérer, prédire l'avenir est devenu un défi sans cesse grandissant. Cependant, c'était un défi que j'étais prêt à relever.\n\n%%Appliquer l'apprentissage automatique pour des modèles prédictifs%%\n\nConvaincu de l'efficacité de l'apprentissage automatique pour résoudre ces situations complexes, j'ai décidé d'appliquer mes compétences en Python pour créer des modèles prédictifs. J'étais motivé par l'idée de faciliter la définition des objectifs pour les futurs projets et d'améliorer ainsi l'efficacité opérationnelle de Degetel.\n\nAprès des semaines de développement, de tests et d'optimisation, mes modèles étaient prêts à être déployés. J'ai utilisé la Google Cloud Platform pour créer des tableaux de bord interactifs, permettant une visualisation claire des projections générées par mes modèles.\n\n%%Les Résultats%%\n\nLe succès de cette initiative a dépassé nos attentes. Les tableaux de bord ont non seulement permis une meilleure compréhension de la performance du projet, mais ils ont également amélioré la transparence et l'efficacité de la prise de décision. De mon côté, cette expérience m'a permis d'approfondir mes compétences en apprentissage automatique et Python, et de me familiariser davantage avec la Google Cloud Platform.\n\nAu-delà de l'impact positif immédiat sur Degetel, ce projet a eu des conséquences durables. La planification et la gestion de projet se sont améliorées, et j'ai acquis une précieuse confiance en moi, qui m'a été utile dans les projets suivants.\n\nEn regardant en arrière, je considère cette expérience avec fierté. J'ai appris qu'avec les bons outils et une approche réfléchie, nous pouvons transformer les défis en opportunités et les données brutes en informations précieuses. Avec le recul, je considère cette expérience comme une étape significative dans ma carrière. Non seulement j'ai eu l'occasion d'appliquer mes compétences en apprentissage automatique à un problème réel, mais j'ai également contribué à transformer la prise de décision chez Degetel. Si je devais entreprendre à nouveau un projet de cette nature, je mettrais encore plus l'accent sur la collaboration avec les parties prenantes pour maximiser la valeur des prédictions et personnaliser davantage les modèles selon leurs besoins spécifiques.",

  "article3Title": "Création d'un site interne améliorant l'efficacité administrative",

  "article3Summary": "article3Summary",

  "article3Text": "%%Développement d'un site web interne pour l'efficacité administrative%%\n\nLorsque j'étais à l'ESIEA, une institution d'ingénierie réputée, j'ai eu l'occasion de travailler sur un projet fascinant. Il s'agissait de développer un site web interne pour le personnel administratif dans le cadre de l'ERP sur lequel je travaillais. Ce site web avait pour but de faciliter l'accès à la liste des étudiants et d'améliorer les opérations administratives.\n\n%%Double Objectif : Efficacité et Conformité%%\n\nLe projet avait un double objectif. D'une part, il visait à améliorer l'efficacité du personnel administratif en améliorant l'accès à l'information. D'autre part, je devais m'assurer que le site web respectait les normes ISO, une exigence cruciale pour l'institution.\n\nDans ce contexte, j'ai développé le site web en veillant à ce qu'il réponde aux besoins spécifiques de l'équipe administrative. J'ai conçu une interface où le personnel pouvait facilement accéder à la liste des étudiants, cliquer sur le profil d'un étudiant pour plus d'informations, exporter les données aux formats XLSX ou DOCX si nécessaire, et générer automatiquement des fiches ISO.\n\nLe développement du site web a pris plusieurs semaines et a impliqué de nombreuses étapes, allant de la conception de l'interface à l'intégration de diverses fonctionnalités et au contrôle de la qualité. Le plus grand défi a été de créer un outil à la fois facile à utiliser et conforme aux normes ISO.\n\n%%Les retours%%\n\nLes retours ont été extrêmement positifs. Le personnel administratif a trouvé le site web incroyablement utile, et le temps nécessaire pour effectuer certaines tâches a été réduit. La conformité aux normes ISO a également été assurée, ce qui a contribué à renforcer la réputation de l'institution.\n\nSur un plan personnel, ce projet m'a permis d'affiner mes compétences en développement web et en gestion de projet. J'ai également appris à travailler avec les normes ISO, ce qui s'est avéré extrêmement utile par la suite.\n\nEn regardant en arrière, je suis fier de cette réalisation. Non seulement elle a apporté une valeur tangible à l'école, mais elle m'a également permis d'acquérir des compétences précieuses. En réfléchissant à cette réalisation, je suis fier de l'impact significatif de mon travail. Le site web que j'ai développé a non seulement simplifié les tâches administratives, mais aussi renforcé la conformité de l'école aux normes ISO. Sur le plan personnel, cette expérience a renforcé mon appréciation de l'importance du développement centré sur l'utilisateur et de la conformité aux normes. Si une opportunité similaire se présentait à nouveau, je consacrerais plus de temps à la recherche de bibliothèques JavaScript existantes. Cela pourrait potentiellement simplifier le processus de développement et accélérer la livraison du produit.",


  "project1title": "Développeur Full Stack",
  "project1description": "Développement de back-end et de front-end pour différentes applications web, y compris des sites web et des applications de gestion de contenu. Utilisation de technologies telles que NodeJS, Express, TailwindCSS, différents frameworks JS tels que VueJS/Angular/React/SolidJS, des base de données MongoDB ou MariaDB/MySQL",
  "project2title": "Développeur en Business Intelligence",
  "project2description": "Développement de solutions de Business Intelligence pour aider les entreprises à prendre des décisions plus éclairées. Utilisation de technologies telles que Power BI/GCP/Tableau, Python, SQL et NoSQL.",
  "project3title": "Développeur d'Intelligence Artificielle",
  "project3description": "Développement de solutions d'IA pour aider les entreprises à automatiser les processus et à améliorer l'efficacité opérationnelle. Utilisation de technologies telles que Python, TensorFlow, PyTorch, Pandas",
  "backToTop": "Retour en haut",
  "footer": "Benjamin Payet. Tous droits réservés.",
  "portfolioproject1title": "MyPerfectList",
  "portfolioproject1text": "MyPerfectList est une Plateforme WEB regroupant différentes collections existantes (IMDb, MAL, etc) et permettant d'en créer d'autres accessible à tous en ayant pour but de centraliser les données des utilisateurs de ses differents sites. Elle permettra donc de ne plus avoir besoin d'utiliser plusieurs liens vers plusiseurs sites differents afin de connaitre les gouts d'une personne et de pouvoir avoir une vue d'ensemble de tous les sites de base de données auquel l'utilisateur est membre ainsi que de voir ses listes personnalisés.",
  "portfolioproject2title": "Trip Over Time",
  "portfolioproject2text": "\"Trip Over Time\" (T.O.T) est un jeu d'aventure en 2D où les joueurs naviguent à travers le temps : le passé Viking dans \"Skyrim\", l'Amazonie actuelle dans \"Mowgli\", et un futur infesté de zombies dans \"Paradise\". Chaque niveau présente des ennemis et des défis uniques, avec un boss important à la fin. Le gameplay implique des commandes de base au clavier et à la souris, tandis que les effets sonores sont créativement conçus par les membres de l'équipe. Le jeu propose des modes multijoueurs potentiels, des mini-jeux, des boosts de progression, et la compatibilité avec les contrôleurs, promettant un gameplay diversifié et immersif.",
  "portfolioproject3title": "ERP ESIEA",
  "portfolioproject3text": "Dans le cadre de mon expérience professionnelle, j'ai mené un projet de développement d'un ERP pour l'ESIEA, en utilisant Go pour le backend et VueJS pour le front. Cette initiative a permis de mettre en œuvre des solutions performantes et efficaces pour la gestion des différentes tâches administratives. J'ai notamment été en charge de la conception du module de gestion des étudiants, qui permet un suivi détaillé et personnalisé de chaque élève. La migration des données de l'ancien ERP vers le nouveau a été un véritable défi en raison de la complexité et de la quantité de données à traiter. Cependant, grâce à une analyse approfondie et une planification minutieuse, j'ai réussi à effectuer la migration sans perte de données et dans les délais impartis. Ce projet m'a permis de renforcer mes compétences en programmation Go et VueJS, et de me familiariser avec la gestion de projets d'envergure.",
  "myValues": "Mes Valeurs",
  "myValuesText": "En tant que professionnel dans le domaine de l'informatique et du développement de logiciels, j'accorde une grande importance à l'éthique, l'intégrité, et la persévérance. Je suis très curieux, toujours prêt à apprendre de nouvelles technologies et à relever de nouveaux défis. J'estime que le respect mutuel et l'esprit d'équipe sont essentiels pour la réussite de tout projet.",
  "myProject": "Mon Projet Professionnel",
  "myProjectText": "Mon objectif professionnel est de continuer à développer mes compétences techniques en tant que développeur Full-Stack, et éventuellement d'évoluer vers un poste de lead développeur ou d'architecte logiciel. Je souhaite travailler sur des projets innovants et techniquement stimulants, qui me permettront de continuer à apprendre et à me développer en tant que professionnel de l'informatique. En parallèle, je suis également passionné par la musique et les jeux vidéo, et j'aimerais à terme pouvoir associer mes compétences techniques à ces centres d'intérêt pour développer des projets personnels dans ces domaines.",
  "myHumanQualities": "Mes Qualités Humaines",
  "myHumanQualitiesText": "Ma motivation, mon investissement personnel et ma persévérance sont des atouts majeurs dans le cadre de mes missions professionnelles. J'apprécie le travail en équipe, et je suis capable de faire preuve de leadership quand cela est nécessaire. Je suis également doté d'une grande capacité d'adaptation, ce qui me permet de me retrouver rapidement à l'aise dans de nouveaux environnements ou face à de nouvelles technologies. Par ailleurs, ma curiosité naturelle m'incite constamment à apprendre et à explorer de nouveaux domaines, que ce soit dans le cadre professionnel ou personnel.",
  "myHobbies": "Mes Loisirs",
  "myHobbiesText": "Mes centres d'intérêt principaux sont la musique et les jeux vidéo. Je pratique la guitare et le piano depuis près de dix ans, et j'ai un goût prononcé pour les jeux vidéo de genres variés comme les FPS, RPG et jeux multijoueur. Je suis également un grand lecteur, avec une prédilection pour les ouvrages scientifiques, informatiques, policiers, de fantaisie et de science-fiction. Ces centres d'intérêt enrichissent ma vie personnelle, mais contribuent également à stimuler ma créativité et mon esprit d'innovation dans ma vie professionnelle."
}
