{
  "name": "Benjamin Payet",
  "downloadResume": "Download Resume",
  "personalInformation": "Personal Information",
  "whoIAm": "Who am I ?",
  "revealContactDetails": "Reveal Contact Details",
  "phoneNumberName": "Phone",
  "emailName": "Email",
  "emailAddress": "Email Address",
  "locationName": "Location",
  "location": "Ile De France, France",
  "birthdayName": "Birthday",
  "birthday": "05 August 1998",
  "whatIDo": "What I Do!",
  "resumeMenu": "Resume",
  "all": "All",
  "proficiencyHuman": "Human Skills",
  "proficiencyTechnical": "Technical Skills",
  "contact": "Contact",
  "contactMePart1": "If you have any questions or would like to work with me, please feel free to ",
  "contactMePart2": "contact me",
  "nameEmailForm": "Name",
  "email": "Email",
  "message": "Message",
  "submit": "Submit",
  "workingSkills": "Working Skills",
  "knowledge": "Knowledge",
  "education": "Education",
  "experience": "Experience",
  "intech": "INTECH Paris (ESIEA Group)",
  "intechDescription": "Master's degree in Software Engineering",
  "commercialLicense": "University Paris Descartes",
  "commercialLicenseDescription": "Professional license in international business",
  "bts": "Bras Fusil High School (Réunion)",
  "btsDescription": "BTS (Advanced Technician's Certificate) in Business Unit Management (MUC)",
  "Lycee": "Admiral Pierre Bouvet High School (Réunion)",
  "LyceeDescription": "Baccalaureate in Science with a specialization in Life and Earth Sciences, with honors",
  "Invivo": "Invivo France – Full-Stack Developer",
  "InvivoDescription": "Development of a web application for data management and reporting",
  "ESIEA": "Esiea Group – Full-Stack Developer Internship (18 months)",
  "ESIEADescription": "Used Go and Quasar/VueJS/Typescript to create an Enterprise Resource Planning (ERP) for the school",
  "Thales": "Thales GTS – Dashboard Tools Developer Internship (6 months)",
  "ThalesDescription": "Created a reporting tool to track development teams' progress",
  "Degetel": "Degetel – Assistant Engineer in Studies and Development Internship (12 months)",
  "DegetelDescription": "Used Salesforce, MySQL, Matlab, and Google Cloud Platform to optimize the company's management",

  "proficiencyHumanTitle1": "Curiosity",
  "proficiencyHumanText1": "%%Importance of Curiosity%%\n\nCuriosity is an important skill in the professional realm, translating into an active desire to discover, learn, and understand new things. It's an attitude that encourages asking questions, exploring different perspectives, and seeking innovative solutions.\n\n%%Nurturing Curiosity%%\n\nCuriosity is vital to me because it enables me to continually grow and develop professionally. It stimulates my creativity, problem-solving abilities, and eagerness to explore new opportunities. My curiosity has also allowed me to deepen my knowledge in related fields, thereby enhancing my flexibility and ability to contribute holistically to projects.\n\n%%Demonstrating Curiosity%%\n\nFor instance, I recently undertook an online training program on emerging technology, which allowed me to develop new skills and effectively apply them in a subsequent project. I've also proposed innovative ideas during team meetings, based on my proactive research and willingness to think differently.\n\nMy proficiency level in the skill of curiosity is high, as I am consistently seeking new knowledge and experiences to improve my professional approach. I remain open to continuous improvement and plan to nurture my curiosity by exploring new domains, developing new skills, and broadening my professional horizons.",
  "proficiencyHumanTitle2": "Autonomy",
  "proficiencyHumanText2": "%%The Significance of Autonomy%%\n\nAutonomy is a crucial skill in the professional field, characterized by the ability to take initiatives, work independently, and assume responsibility for one's own actions. It's the ability to be autonomous in planning, organizing, and executing tasks while demonstrating discernment and making sound decisions.\n\n%%Benefits of Autonomy%%\n\nAutonomy is essential to me because it enables me to efficiently manage my work, make informed decisions, and deliver high-quality results. By being autonomous, I can manage my time effectively, prioritize tasks, proactively address issues, and make informed decisions when required.\n\n%%Demonstrating Autonomy%%\n\nFor instance, I was recently assigned a complex project that required end-to-end autonomous management. I effectively planned and organized the various stages of the project, using my analytical and problem-solving skills to overcome obstacles and achieve set objectives. I received praise for my ability to make sound decisions and maintain a high level of quality despite challenges.\n\nMy proficiency level in the skill of autonomy is high, as I have repeatedly demonstrated my ability to work independently and deliver satisfactory results. However, I remain open to learning opportunities and continuous improvement, as there are always ways to enhance and refine this skill.\n\nAutonomy holds a central position in both my personal and professional activities. I'm constantly seeking to develop my skills in autonomous management, focusing on strategic planning, informed decision-making, and proactive project management. I'm also committed to sharing my knowledge and experience in autonomy with colleagues and encouraging them to cultivate their own autonomy for greater productivity and efficiency.",
  "proficiencyHumanTitle3": "Project Management",
  "proficiencyHumanText3": "%%The Importance of Project Management%%\n\nProject management is an essential skill in the professional field, encompassing the organization, coordination, and supervision of all activities necessary to achieve a specific goal. It involves thorough project planning, effective resource allocation, time management, clear communication, and the ability to address problems that may arise.\n\n%%Proficiency in Project Management%%\n\nProject management is of critical importance in my professional context. As an engineer, I've often been tasked with leading and managing complex projects, ranging from software development to the implementation of technical solutions. I'm responsible for resource allocation, goal definition, risk identification, and project team coordination.\n\n%%Evolving Project Management Skill%%\n\nFor instance, I recently led a project to implement a supply chain management system. I developed a comprehensive plan, identified key steps, assigned tasks to team members, and monitored the project's progress. Through effective management, the project was delivered within the specified timeline and met the client's expectations.\n\nMy proficiency level in the skill of project management is high, as I have gained substantial experience in handling complex projects and addressing associated challenges. I have a good understanding of project management methodologies such as the waterfall model and agile approach, and I can apply best practices tailored to each situation.\n\nUpon reflection, I acknowledge that project management is an ever-evolving skill. Although I have achieved success in various projects, there are always lessons to be learned and opportunities for improvement. I continue to strengthen my expertise in project management by attending training, staying updated on industry trends, and sharing my experiences with other professionals.\n\nProject management holds a central position in both my personal and professional activities. I plan to further develop my project management skills by gaining experience in larger-scale projects and assuming increased management responsibilities. I'm also interested in obtaining recognized project management certifications to enhance my credibility and skills in this field.",



  "proficiencyTechnicalTitle1": "Full Stack Developer",
  "proficiencyTechnicalText1": "%%The Essence of Full Stack Development%%\n\nFull Stack development is an essential skill in the professional field of programming, encompassing mastery of both client-side (front-end) and server-side (back-end) development. This means having a deep understanding of technologies, programming languages, and frameworks used in both areas.\n\n%%Versatility and Collaboration%%\n\nAs a Full Stack developer, I am capable of creating complete web applications, from designing the user interface to setting up server-side features. I am proficient with languages such as HTML, CSS, and JavaScript for the front-end, as well as languages like Python, Ruby, or Java for the back-end. I also master popular frameworks such as React, Angular, Node.js, and Django.\n\n%%Proficiency and Continuous Learning%%\n\nThe proficiency of a Full Stack developer is crucial in my professional context, as it allows me to be versatile and work on diverse projects. Being able to manage both the front-end and back-end components of an application, I can collaborate effectively with team members, understand user needs, and implement comprehensive solutions.\n\nFor instance, I recently worked on a project to develop an e-commerce platform. As a Full Stack developer, I was responsible for creating the engaging and responsive user interface, along with developing product management, payments, and order functions on the server side. Thanks to my command of front-end and back-end technologies, I was able to provide a seamless and functional user experience.\n\nMy proficiency level in Full Stack development is high, as I have acquired extensive experience in creating complete web applications. I have participated in numerous projects where I was able to put my front-end and back-end development skills into practice, as well as integrate various technologies.\n\nUpon reflection, I acknowledge that the Full Stack development field is continuously evolving. It's important to stay current with the latest technologies and emerging trends to continue to provide innovative solutions. I am open to continual learning and regularly seek opportunities to enhance my skills and explore new technologies.\n\nIn my personal and professional endeavors, Full Stack development holds a central position. I plan to continue expanding my skills by learning new technologies, working on complex projects, and collaborating with experts in the field. I'm also interested in deepening my knowledge in specific areas such as artificial intelligence, cybersecurity, or virtual reality, to broaden my perspectives as a Full Stack developer.",
  "proficiencyTechnicalTitle2": "Business Intelligence Developer",
  "proficiencyTechnicalText2": "%%Significance of Business Intelligence Development%%\n\nDevelopment in Business Intelligence (BI) is a vital skill in the professional field of data analysis, which involves collecting, processing, and transforming raw data into meaningful and actionable information for strategic decisions. As a BI developer, I am capable of designing and implementing technological solutions for data analysis and visualization.\n\n%%Enabling Informed Decision-making%%\n\nThe competency of a Business Intelligence developer is of great importance in my professional context, as it allows the potential of data to be harnessed for informed decision-making. Using tools such as data warehouses, ETLs (Extract, Transform, Load), dashboards, and reports, I am able to transform data into visual and understandable information, thus facilitating fact-based decision-making.\n\n%%Implementation and Continuous Improvement%%\n\nFor example, I recently worked on a BI project aimed at helping a company optimize its production processes. I extracted relevant data from various sources, cleaned them, and structured them into a data warehouse. I then developed interactive dashboards that allowed users to track and analyze the performance of various production stages in real-time. This solution enabled the company to make quick and informed decisions to improve its operational efficiency.\n\nMy mastery level of the Business Intelligence developer competency is high, as I have solid experience in designing and implementing BI solutions. I have worked with different tools and technologies such as Power BI, Tableau, SQL, Python, as well as data mining techniques and modeling. I am able to understand user needs, design suitable solutions, and transform data into actionable information.\n\nIn my critical review, I recognize that the field of Business Intelligence is constantly evolving, with the emergence of new technologies and new approaches to data analysis. It is important to stay up-to-date with the latest trends and best practices to provide effective and innovative solutions. I am motivated to continue developing my skills by participating in trainings, exploring new technologies, and sharing my knowledge with other professionals.\n\nIn my personal and professional project, the competency of a Business Intelligence developer plays a central role. I plan to continue deepening my knowledge in the field by pursuing specialized trainings and working on larger-scale projects. I am also interested in integrating artificial intelligence and machine learning into BI solutions, in order to leverage their potential for more advanced analyses and more accurate forecasts.",
  "proficiencyTechnicalTitle3": "Artificial Intelligence Developer",
  "proficiencyTechnicalText3": "%%The Power of Artificial Intelligence Development%%\n\nArtificial Intelligence (AI) development is a crucial skill in the professional field of process automation and improving businesses' operational efficiency. As an AI developer, I am capable of designing, developing, and deploying AI-based solutions to solve complex problems and make intelligent decisions.\n\n%%Leveraging Automation and Machine Learning%%\n\nThe skill of an AI developer is of great importance in my professional context, as it allows businesses to leverage the benefits of automation and machine learning to optimize their processes and achieve more accurate and efficient results. Using technologies such as Python, TensorFlow, PyTorch, and Pandas, I am able to develop machine learning models, process large amounts of data, and create intelligent systems capable of learning and evolving.\n\n%%Proficiency and Continuous Learning%%\n\nFor instance, I recently worked on an AI project aimed at automating document classification in a company. I developed a machine learning model based on deep neural networks that was able to read and automatically classify documents based on their content. This allowed the company to save valuable time by avoiding the manual task of classification and improving the efficiency of its operations.\n\nMy proficiency level as an AI developer is high, as I have gained solid experience in designing, developing, and deploying AI solutions. I have a good understanding of machine learning concepts and advanced techniques such as neural networks, natural language processing algorithms, and computer vision. I am capable of implementing AI models, training them on data sets, and evaluating their performance.\n\n",

  "aboutMe": "About Me",
  "aboutMeText": "My name is Benjamin Payet, and I am currently a 5th-year Software Engineering student at INTECH Paris, looking for a 6-month work-study opportunity starting in March to complete my studies. Dynamic, curious, and persevering, I fully invest myself in my projects. I have gained solid experience in software development through various professional experiences, including as a full-stack developer for the ESIEA group, a Dashboard tools development intern at Thales GTS, and a study and development engineering assistant at DEGETEL. My technical skills include proficiency in various programming languages and technologies such as VueJS, JavaScript, MySQL, HTML, CSS, C#, Python, C++, and PHP. I have also worked on several computer projects, such as Trip Over Time, a 2D Mario-like game developed in C#, and MyPerfectList, a website that allows users to manage all their watchlists through APIs from MyAnimeList, IMDb, Goodreads, and others. In addition to my passion for computer science, I am an avid music enthusiast, playing guitar and piano for nine years. I also enjoy reading (scientific, computer, crime, fantasy, science fiction) and video games (FPS, RPG, multiplayer games, adventure). As part of human development projects, I have participated in volunteer activities such as Sept de Coeur, where I taught French, English, and computer science to disadvantaged people with the Coeur du Cinq association, and InGame, where I organized an online video game tournament during the lockdown. I am fluent in English and have scored 100/120 on the TOEFL. Having studied International Trade at the University of Paris Descartes and Management of Commercial Units (MUC) at the Lycée de Bras Fusil in Réunion, I also have a solid background in commerce and management. Please feel free to contact me to discuss my skills and your needs. I am confident that my profile and experience can be an asset to your company.",
  "jobTitle": "Software Engineer",
  "aboutMenu": "About",
  "homeMenu": "Home",
  "portfolioMenu": "Portfolio",
  "contactMenu": "Contact",
  "articlesMenu": "Articles",

  "article1Title": "Implementation of Automated Performance Indicators",
  "article1Summary": "article1Summary",

  "article1Text": "%%Efficiency and Integration%%\n\nWhen I joined Thales as a software designer, I found myself in an environment where data required to track the team's work was scattered across several systems, including Jira, Excel, and Salesforce. The diversity of information sources and the need for consolidated, efficient monitoring for the Scrum Master both presented a challenge and an opportunity.\n\n%%Creating an Automated Dashboard%%\n\nThe primary concern was to improve operational efficiency and team productivity. The challenge for me lay in seamlessly integrating these different systems and in managing the information appropriately. I was also aware of the associated risks, specifically the potential integration problems from all these sources and the complexity of the tools.\n\nI then embarked on an ambitious project: to create an automated dashboard that consolidated data from all these tools. The objective was to provide the Scrum Master with a unified view of the team's performance, while identifying areas requiring improvement.\n\nOver the following three months, I implemented scripts to extract information from each system, then developed mechanisms to automate the process. Concurrently, I designed the dashboard to meet the Scrum Master's requirements. This achievement required a deep understanding of the tools, the ability to handle data from diverse sources, and a knack for automation.\n\nIn the end, the effort paid off. The automated dashboards enhanced visibility of the team's work for the Scrum Master, thereby facilitating decision-making. On a personal level, I gained valuable experience in data manipulation and automation.\n\n%%Impact and Reflections%%\n\nBeyond the project, the implementation of these dashboards resulted in significant time savings and more informed decision-making, adding value to Thales. For my part, I was able to strengthen my expertise in data management and automation, which undeniably enriched my profile as a software designer.\n\nToday, I look back at this project with a sense of satisfaction. I learned the importance of automation and how it can enhance operational efficiency. If I were to undertake a similar project in the future, I would aim to involve end users more from the outset, to better understand their needs and subsequently tailor the solutions I develop.\n",
  "article2Title": "Revolution in Performance Prediction: My Experience with Machine Learning in Project Performance Forecasting",
  "article2Summary": "Article Summary",



  "article2Text": "%%Exploring Project Performance Prediction%%\n\nAt Degetel, a reputable digital solutions company, I had the opportunity to explore the complex world of project performance prediction. With a plethora of variable elements to consider, predicting the future became an ever-growing challenge. However, it was a challenge I was ready to tackle.\n\n%%Applying Machine Learning for Predictive Models%%\n\nConvinced of the effectiveness of machine learning in addressing these complex situations, I decided to apply my Python skills to create predictive models. I was motivated by the idea of facilitating goal-setting for future projects and thereby enhancing Degetel's operational efficiency.\n\nAfter weeks of development, testing, and optimization, my models were ready to be deployed. I utilized the Google Cloud Platform to create interactive dashboards, allowing for clear visualization of the projections generated by my models.\n\n%%The Results%%\n\nThe success of this initiative exceeded our expectations. The dashboards not only provided a better understanding of project performance, but they also improved the transparency and efficiency of decision-making. On my part, this experience enabled me to deepen my skills in machine learning and Python, and to become more familiar with the Google Cloud Platform.\n\nBeyond the immediate positive impact on Degetel, this project had lasting consequences. Project planning and management improved, and I gained valuable self-confidence, which served me in subsequent projects.\n\nLooking back, I view this experience with pride. I learned that with the right tools and a thoughtful approach, we can turn challenges into opportunities and raw data into valuable insights. In retrospect, I value this experience as a significant milestone in my career. Not only did I have the opportunity to apply my machine learning skills to a real-world problem, but I also contributed to transforming decision-making at Degetel. If I were to undertake a project of this nature again, I would place even greater emphasis on collaboration with stakeholders to maximize the value of predictions and further tailor the models to their specific needs.",
  "article3Title": "Creation of an Internal Site Enhancing Administrative Efficiency",
  "article3Summary": "article3Summary",
  "article3Text": "%%Developing an Internal Website for Administrative Efficiency%%\n\nWhen I was at ESIEA, a reputable engineering institution, I had the opportunity to work on a fascinating project. It involved developing an internal website for the administrative staff as part of the ERP on which I was working. This website was designed to facilitate access to the student list and enhance administrative operations.\n\n%%Dual Objective: Efficiency and Compliance%%\n\nThe project had a dual objective. On one hand, it aimed to boost the efficiency of the administrative staff by improving access to information. On the other hand, I had to ensure that the website complied with ISO standards, a critical requirement for the institution.\n\nIn this context, I developed the website ensuring it met the specific needs of the administrative team. I designed an interface where staff could easily access the student list, click on a student's profile for more information, export the data in XLSX or DOCX formats as needed, and automatically generate ISO sheets.\n\nThe development of the website took several weeks and involved many steps, ranging from the design of the interface to the integration of various features and quality control. The biggest challenge was to create a tool that was both easy to use and compliant with ISO standards.\n\n%%The feedback%%\n\nThe feedback was overwhelmingly positive. The administrative staff found the website incredibly useful, and the time required to perform certain tasks was reduced. Compliance with ISO standards was also ensured, which contributed to enhancing the institution's reputation.\n\nOn a personal level, this project allowed me to hone my web development and project management skills. I also learned to work with ISO standards, which proved extremely useful later on.\n\nLooking back, I'm proud of this achievement. Not only did it deliver tangible value to the school, but it also enabled me to acquire valuable skills. Reflecting on this accomplishment, I am proud of the significant impact of my work. The website I developed not only simplified administrative tasks but also boosted the school's compliance with ISO standards. On a personal level, this experience reinforced my appreciation of the importance of user-centered development and standards compliance. If a similar opportunity arose again, I would invest more time researching existing JavaScript libraries. This could potentially simplify the development process and expedite product delivery.",

  "project1title": "Full Stack Developer",
  "project1description": "Development of back-end and front-end for various web applications, including websites and content management applications. Use of technologies such as NodeJS, Express, TailwindCSS, different JS frameworks such as VueJS/Angular/React/SolidJS, and databases like MongoDB or MariaDB/MySQL.",
  "project2title": "Business Intelligence Developer",
  "project2description": "Development of Business Intelligence solutions to assist companies in making more informed decisions. Use of technologies such as Power BI/GCP/Tableau, Python, SQL, and NoSQL.",
  "project3title": "Artificial Intelligence Developer",
  "project3description": "Development of AI solutions to assist companies in automating processes and improving operational efficiency. Use of technologies such as Python, TensorFlow, PyTorch, Pandas.",
  "backToTop": "Back to top",
  "footer": "Benjamin Payet. All rights reserved.",
  "portfolioproject1title": "MyPerfectList",
  "portfolioproject1text": "MyPerfectList is a WEB platform that brings together various existing collections (IMDb, MAL, etc.) and allows the creation of new ones accessible to everyone, with the aim of centralizing user data from these different sites. Therefore, it eliminates the need to use multiple links to various different sites to know a person's tastes and to be able to have an overview of all the database sites that the user is a member of, as well as to view their customized lists.",
  "portfolioproject2title": "Trip Over Time",
  "portfolioproject2text": "\"Trip Over Time\" (T.O.T) is a 2D adventure game where players navigate through time: Viking past in \"Skyrim,\" present-day Amazon in \"Mowgli,\" and zombie-infested future in \"Paradise.\" Each level features unique enemies and challenges, with a significant boss at the end. Gameplay involves basic keyboard and mouse controls, while sound effects are creatively crafted by the team members. The game offers potential multiplayer modes, mini-games, progression boosts, and controller compatibility, promising diverse and immersive gameplay.",
  "portfolioproject3title": "ERP ESIEA",
  "portfolioproject3text": "In the context of my professional experience, I spearheaded the development of an ERP for ESIEA, using Go for the backend and VueJS for the frontend. This initiative enabled the implementation of efficient and effective solutions for various administrative tasks. I was specifically responsible for designing the student management module, which allows detailed and personalized tracking of each student. Data migration from the old ERP to the new one was a significant challenge due to the complexity and volume of data to handle. However, with thorough analysis and careful planning, I successfully carried out the migration without data loss and within the stipulated time frame. This project allowed me to strengthen my Go and VueJS programming skills and familiarize myself with managing large-scale projects.",
  "myValues": "My Values",
  "myValuesText": "As a professional in the field of computer science and software development, I attach great importance to ethics, integrity, and perseverance. I am very curious, always ready to learn new technologies and take on new challenges. I believe that mutual respect and team spirit are essential for the success of any project.",
  "myProject": "My Professional / Personal Project",
  "myProjectText": "My professional goal is to continue to develop my technical skills as a Full-Stack developer, and eventually to move into a lead developer or software architect position. I wish to work on innovative and technically stimulating projects, which will allow me to continue to learn and develop as an IT professional. In parallel, I am also passionate about music and video games, and I would like to be able to combine my technical skills with these interests to develop personal projects in these areas.",
  "myHumanQualities": "My Main Human Qualities",
  "myHumanQualitiesText": "My motivation, personal investment, and perseverance are major assets in the context of my professional assignments. I enjoy teamwork and am capable of demonstrating leadership when necessary. I also have a great ability to adapt, which allows me to quickly become comfortable in new environments or with new technologies. Furthermore, my natural curiosity constantly encourages me to learn and explore new fields, whether in a professional or personal context.",
  "myHobbies": "My Main Hobbies",
  "myHobbiesText": "My main interests are music and video games. I have been playing guitar and piano for nearly ten years, and I have a pronounced taste for video games of various genres like FPS, RPG, and multiplayer games. I am also an avid reader, with a predilection for scientific, computer, crime, fantasy, and science fiction books. These interests enrich my personal life but also contribute to stimulating my creativity and innovative spirit in my professional life."
}
