{
  "name": "Benjamin Payet",
  "downloadResume": "Download Resume",
  "personalInformation": "Personal Information",
  "whoIAm": "Who am I ?",
  "revealContactDetails": "Reveal Contact Details",
  "phoneNumberName": "Phone",
  "emailName": "Email",
  "emailAddress": "Email Address",
  "locationName": "Location",
  "location": "Ile De France, France",
  "birthdayName": "Birthday",
  "birthday": "05 August 1998",
  "whatIDo": "What I Do!",
  "resumeMenu": "Resume",
  "all": "All",
  "proficiencyHuman": "Human Skills",
  "proficiencyTechnical": "Technical Skills",
  "contact": "Contact",
  "contactMePart1": "If you have any questions or would like to work with me, please feel free to ",
  "contactMePart2": "contact me",
  "nameEmailForm": "Name",
  "email": "Email",
  "message": "Message",
  "submit": "Submit",
  "workingSkills": "Working Skills",
  "knowledge": "Knowledge",
  "education": "Education",
  "experience": "Experience",
  "intech": "INTECH Paris (ESIEA Group)",
  "intechDescription": "Master's degree in Software Engineering",
  "commercialLicense": "University Paris Descartes",
  "commercialLicenseDescription": "Professional license in international business",
  "bts": "Bras Fusil High School (Réunion)",
  "btsDescription": "BTS (Advanced Technician's Certificate) in Business Unit Management (MUC)",
  "Lycee": "Admiral Pierre Bouvet High School (Réunion)",
  "LyceeDescription": "Baccalaureate in Science with a specialization in Life and Earth Sciences, with honors",
  "Invivo": "Invivo France – Full-Stack Developer",
  "InvivoDescription": "Development of a web application for data management and reporting",
  "ESIEA": "Esiea Group – Full-Stack Developer Internship (18 months)",
  "ESIEADescription": "Used Go and Quasar/VueJS/Typescript to create an Enterprise Resource Planning (ERP) for the school",
  "Thales": "Thales GTS – Dashboard Tools Developer Internship (6 months)",
  "ThalesDescription": "Created a reporting tool to track development teams' progress",
  "Degetel": "Degetel – Assistant Engineer in Studies and Development Internship (12 months)",
  "DegetelDescription": "Used Salesforce, MySQL, Matlab, and Google Cloud Platform to optimize the company's management",

  "proficiencyHumanTitle1": "Curiosity",
  "proficiencyHumanText1": "Curiosity is an essential skill in the professional field, which translates into an active desire to discover, learn, and understand new things. It is an attitude that encourages asking questions, exploring different perspectives, and seeking innovative solutions.\n\nCuriosity is important to me because it allows me to continue to grow and evolve professionally. It stimulates my creativity, problem-solving abilities, and willingness to explore new opportunities. My curiosity has also allowed me to deepen my knowledge in related fields, thereby enhancing my versatility and ability to contribute holistically to projects.\n\nFor example, I recently embarked on an online training course on an emerging technology, which enabled me to develop new skills and successfully apply them in a subsequent project. I have also proposed innovative ideas during team meetings, based on my proactive research and willingness to think differently.\n\nMy proficiency level in the skill of curiosity is high, as I am constantly seeking new knowledge and experiences to enrich my professional practice. I remain open to continuous improvement and plan to nurture my curiosity by exploring new domains, developing new skills, and expanding my professional horizons.",
  "proficiencyHumanTitle2": "Autonomy",
  "proficiencyHumanText2": "Autonomy is a key skill in the professional field, characterized by the ability to take initiatives, work independently, and take responsibility for one's own actions. It is the ability to be self-reliant in planning, organizing, and executing tasks while demonstrating discernment and making sound decisions.\n\nAutonomy is important to me because it enables me to effectively manage my work, make informed decisions, and deliver quality results. By being autonomous, I am able to manage my time efficiently, prioritize tasks, proactively solve problems, and make informed decisions when necessary.\n\nFor example, I was recently assigned a complex project that required end-to-end autonomous management. I successfully planned and organized the various stages of the project, using my analytical and problem-solving skills to overcome obstacles and achieve set objectives. I was commended for my ability to make sound decisions and maintain a high level of quality despite challenges.\n\nMy proficiency level in the skill of autonomy is high, as I have repeatedly demonstrated my ability to work independently and deliver satisfactory results. However, I remain open to learning opportunities and continuous improvement, as there are always ways to strengthen and refine this skill.\n\nAutonomy holds a central position in both my personal and professional projects. I am constantly seeking to develop my skills in autonomous management, focusing on strategic planning, informed decision-making, and proactive task management. I am also committed to sharing my knowledge and experience in autonomy with colleagues and encouraging them to cultivate their own autonomy for greater efficiency and performance.",
  "proficiencyHumanTitle3": "Project Management",
  "proficiencyHumanText3": "Project management is a fundamental skill in the professional field, encompassing the organization, coordination, and supervision of all activities necessary to achieve a specific goal. It involves rigorous task planning, efficient resource allocation, time management, clear communication, and the ability to solve problems that may arise.\n\nProject management is of paramount importance in my professional context. As an engineer, I have often been tasked with leading and supervising complex projects, ranging from software development to the implementation of technological solutions. I am responsible for resource allocation, goal definition, risk identification, and project team coordination.\n\nFor example, I recently led a project to implement a supply chain management system. I developed a detailed plan, identified key steps, assigned tasks to team members, and monitored the project's progress. Through effective management, the project was delivered within the specified timeline and met the client's expectations.\n\nMy proficiency level in the skill of project management is high, as I have gained solid experience in managing complex projects and addressing associated challenges. I have a good understanding of project management methodologies such as the waterfall model or agile methodology, and I am able to apply best practices tailored to each situation.\n\nIn my critical assessment, I recognize that project management is an ever-evolving skill. Although I have achieved success in many projects, there are always lessons to be learned and opportunities for improvement. I continue to deepen my knowledge in project management by participating in training, staying updated on industry trends, and sharing my experiences with other professionals.\n\nProject management holds a central position in both my personal and professional projects. I plan to further develop my project management skills by gaining experience in larger-scale projects and assuming increased management responsibilities. I am also interested in obtaining recognized project management certifications to strengthen my credibility and skills in this field.",


  "aboutMe": "About Me",
  "aboutMeText": "My name is Benjamin Payet, and I am currently a 5th-year Software Engineering student at INTECH Paris, looking for a 6-month work-study opportunity starting in March to complete my studies. Dynamic, curious, and persevering, I fully invest myself in my projects. I have gained solid experience in software development through various professional experiences, including as a full-stack developer for the ESIEA group, a Dashboard tools development intern at Thales GTS, and a study and development engineering assistant at DEGETEL. My technical skills include proficiency in various programming languages and technologies such as VueJS, JavaScript, MySQL, HTML, CSS, C#, Python, C++, and PHP. I have also worked on several computer projects, such as Trip Over Time, a 2D Mario-like game developed in C#, and MyPerfectList, a website that allows users to manage all their watchlists through APIs from MyAnimeList, IMDb, Goodreads, and others. In addition to my passion for computer science, I am an avid music enthusiast, playing guitar and piano for nine years. I also enjoy reading (scientific, computer, crime, fantasy, science fiction) and video games (FPS, RPG, multiplayer games, adventure). As part of human development projects, I have participated in volunteer activities such as Sept de Coeur, where I taught French, English, and computer science to disadvantaged people with the Coeur du Cinq association, and InGame, where I organized an online video game tournament during the lockdown. I am fluent in English and have scored 100/120 on the TOEFL. Having studied International Trade at the University of Paris Descartes and Management of Commercial Units (MUC) at the Lycée de Bras Fusil in Réunion, I also have a solid background in commerce and management. Please feel free to contact me to discuss my skills and your needs. I am confident that my profile and experience can be an asset to your company.",
  "jobTitle": "Software Engineer",
  "aboutMenu": "About",
  "homeMenu": "Home",
  "portfolioMenu": "Portfolio",
  "contactMenu": "Contact",
  "articlesMenu": "Articles",
  "article1Title": "Implementation of Automated Performance Indicators",
  "article1Summary": "article1Summary",
  "article1Text": "When I joined Thales as a software engineer, I found myself in an environment where the data necessary to monitor the team's work was scattered across several platforms, including Jira, Excel, and Salesforce. The diversity of data sources and the need for consolidated and efficient tracking for the SCRUM Master both posed a challenge and an opportunity.\n\nThe main issue was to improve operational efficiency and team productivity. The challenge for me lay in the seamless integration of these various platforms and in manipulating the data accordingly. I was also aware of the associated risks, particularly the potential integration difficulties of all these sources and the complexity of the tools.\n\nI then embarked on an ambitious project: to create an automated dashboard consolidating the data from all these tools. The goal was to provide the SCRUM Master with a unified view of the team's performance, while identifying areas requiring improvements.\n\nOver the following three months, I implemented scripts to extract data from each platform, before developing mechanisms to automate the process. Concurrently, I designed the dashboard according to the needs of the SCRUM Master. This achievement required a deep understanding of the tools, the ability to manage data from diverse sources, and a skill in automation.\n\nIn the end, the effort paid off. The automated dashboards improved visibility of the team's work for the SCRUM Master, thus facilitating decision-making. On a personal level, I gained valuable experience in data manipulation and automation.\n\nBeyond the project, the implementation of these dashboards led to significant time savings and more informed decision-making, adding value to Thales. For my part, I was able to strengthen my expertise in data management and automation, which undoubtedly enriched my profile as a software engineer.\n\nToday, I look back at this project with a sense of pride. I learned the importance of automation and how it can enhance operational efficiency. If I were to undertake a similar project in the future, I would seek to involve end users more from the beginning, in order to better understand their needs and accordingly tailor the solutions I develop.",
  "article2Title": "Revolution in Performance Prediction: My Experience with Machine Learning in Project Performance Forecasting",
  "article2Summary": "article2Summary",
  "article2Text": "At Degetel, a reputable digital services company, I had the opportunity to dive into the complex world of project performance prediction. With a multitude of variable factors to consider, predicting the future became an ever-growing challenge. But it was a challenge I was ready to tackle.\n\nConvinced of the effectiveness of machine learning in handling these complex situations, I decided to use my Python skills to create predictive models. I was driven by the idea of facilitating goal-setting for future projects and thus improving Degetel's operational efficiency.\n\nAfter weeks of development, testing, and optimization, my models were ready to be deployed. I used the Google Cloud platform to create interactive dashboards, allowing for a clear visualization of the forecasts generated by my models.\n\nThe success of this initiative exceeded our expectations. The dashboards not only provided a better understanding of project performance, but they also improved the transparency and efficiency of decision-making. On my part, this experience allowed me to deepen my skills in machine learning and Python, and to become more familiar with the Google Cloud Platform.\n\nBeyond the immediate positive impact on Degetel, this project had lasting repercussions. Project planning and management improved, and I gained valuable self-confidence, which served me in subsequent projects.\n\nLooking back, I view this experience with pride. I learned that with the right tools and a thoughtful approach, we can turn challenges into opportunities and raw data into valuable insights. In retrospect, I cherish this experience as a significant milestone in my career. Not only did I have the opportunity to apply my machine learning skills to a real-world problem, but I also contributed to transforming decision-making at Degetel. If I were to revisit a project of this nature, I would place even greater emphasis on collaboration with users to maximize the value of predictions and further tailor the models to their specific needs.",
  "article3Title": "Creation of an Internal Site Enhancing Administrative Efficiency",
  "article3Summary": "article3Summary",
  "article3Text": "When I was at ESIEA, a reputable engineering school, I had the opportunity to work on an exciting project. It involved developing an internal site for the administrative staff, as part of the ERP I was working on. This site was meant to facilitate access to the student list and improve administrative operations.\n\nThe project had a dual objective. On one hand, it aimed to enhance the efficiency of the administrative staff by streamlining access to information. On the other hand, I had to ensure that the site complied with ISO standards, an important requirement for the school.\n\nIn this context, I designed the site ensuring it met the specific needs of the administrative team. I created an interface where staff could easily access the student list, click on a student's profile for more information, export the data in XLSX or DOCX formats as needed, and automatically generate ISO sheets.\n\nThe development of the site took several weeks and involved many steps, ranging from the design of the interface to the integration of different features and quality assurance. The biggest challenge was to create a tool that was both easy to use and complied with ISO standards.\n\nThe feedback was overwhelmingly positive. The administrative staff found the site extremely useful, and the time required to accomplish certain tasks was reduced. Compliance with ISO standards was also ensured, which contributed to reinforcing the school's image.\n\nOn a personal level, this project allowed me to strengthen my web development and project management skills. I also learned to work with ISO standards, which proved very useful later.\n\nLooking back, I'm proud of this accomplishment. Not only did it bring tangible value to the school, but it also enabled me to acquire valuable skills. Reflecting on this accomplishment, I am proud of the tangible impact of my work. The site I developed not only simplified administrative tasks, but also strengthened the school's compliance with ISO standards. On a personal level, this experience reinforced my awareness of the importance of user-centered development and standards compliance. If a similar opportunity arose again, I would invest more time researching existing JavaScript libraries. This would likely simplify the development process and expedite the product delivery.",

  "project1title": "Full Stack Developer",
  "project1description": "Development of back-end and front-end for various web applications, including websites and content management applications. Use of technologies such as NodeJS, Express, TailwindCSS, different JS frameworks such as VueJS/Angular/React/SolidJS, and databases like MongoDB or MariaDB/MySQL.",
  "project2title": "Business Intelligence Developer",
  "project2description": "Development of Business Intelligence solutions to assist companies in making more informed decisions. Use of technologies such as Power BI/GCP/Tableau, Python, SQL, and NoSQL.",
  "project3title": "Artificial Intelligence Developer",
  "project3description": "Development of AI solutions to assist companies in automating processes and improving operational efficiency. Use of technologies such as Python, TensorFlow, PyTorch, Pandas.",
  "backToTop": "Back to top",
  "footer": "Benjamin Payet. All rights reserved.",
  "portfolioproject1title": "MyPerfectList",
  "portfolioproject1text": "MyPerfectList is a WEB platform that brings together various existing collections (IMDb, MAL, etc.) and allows the creation of new ones accessible to everyone, with the aim of centralizing user data from these different sites. Therefore, it eliminates the need to use multiple links to various different sites to know a person's tastes and to be able to have an overview of all the database sites that the user is a member of, as well as to view their customized lists.",
  "portfolioproject2title": "Trip Over Time",
  "portfolioproject2text": "\"Trip Over Time\" (T.O.T) is a 2D adventure game where players navigate through time: Viking past in \"Skyrim,\" present-day Amazon in \"Mowgli,\" and zombie-infested future in \"Paradise.\" Each level features unique enemies and challenges, with a significant boss at the end. Gameplay involves basic keyboard and mouse controls, while sound effects are creatively crafted by the team members. The game offers potential multiplayer modes, mini-games, progression boosts, and controller compatibility, promising diverse and immersive gameplay.",
  "portfolioproject3title": "ERP ESIEA",
  "portfolioproject3text": "In the context of my professional experience, I spearheaded the development of an ERP for ESIEA, using Go for the backend and VueJS for the frontend. This initiative enabled the implementation of efficient and effective solutions for various administrative tasks. I was specifically responsible for designing the student management module, which allows detailed and personalized tracking of each student. Data migration from the old ERP to the new one was a significant challenge due to the complexity and volume of data to handle. However, with thorough analysis and careful planning, I successfully carried out the migration without data loss and within the stipulated time frame. This project allowed me to strengthen my Go and VueJS programming skills and familiarize myself with managing large-scale projects.",
  "myValues": "My Values",
  "myValuesText": "As a professional in the field of computer science and software development, I attach great importance to ethics, integrity, and perseverance. I am very curious, always ready to learn new technologies and take on new challenges. I believe that mutual respect and team spirit are essential for the success of any project.",
  "myProject": "My Professional / Personal Project",
  "myProjectText": "My professional goal is to continue to develop my technical skills as a Full-Stack developer, and eventually to move into a lead developer or software architect position. I wish to work on innovative and technically stimulating projects, which will allow me to continue to learn and develop as an IT professional. In parallel, I am also passionate about music and video games, and I would like to be able to combine my technical skills with these interests to develop personal projects in these areas.",
  "myHumanQualities": "My Main Human Qualities",
  "myHumanQualitiesText": "My motivation, personal investment, and perseverance are major assets in the context of my professional assignments. I enjoy teamwork and am capable of demonstrating leadership when necessary. I also have a great ability to adapt, which allows me to quickly become comfortable in new environments or with new technologies. Furthermore, my natural curiosity constantly encourages me to learn and explore new fields, whether in a professional or personal context.",
  "myHobbies": "My Main Hobbies",
  "myHobbiesText": "My main interests are music and video games. I have been playing guitar and piano for nearly ten years, and I have a pronounced taste for video games of various genres like FPS, RPG, and multiplayer games. I am also an avid reader, with a predilection for scientific, computer, crime, fantasy, and science fiction books. These interests enrich my personal life but also contribute to stimulating my creativity and innovative spirit in my professional life."
}
