{
  "myProgrammerPortfolio": "My Programmer Portfolio",
  "contactEmail": "your.email@example.com",
  "aboutMe": "About Me",
  "aboutMeText": "My name is Benjamin Payet, and I am currently a 5th-year Software Engineering student at INTECH Paris, looking for a 6-month work-study opportunity starting in March to complete my studies. Dynamic, curious, and persevering, I fully invest myself in my projects. I have gained solid experience in software development through various professional experiences, including as a full-stack developer for the ESIEA group, a Dashboard tools development intern at Thales GTS, and a study and development engineering assistant at DEGETEL. My technical skills include proficiency in various programming languages and technologies such as VueJS, JavaScript, MySQL, HTML, CSS, C#, Python, C++, and PHP. I have also worked on several computer projects, such as Trip Over Time, a 2D Mario-like game developed in C#, and MyPerfectList, a website that allows users to manage all their watchlists through APIs from MyAnimeList, IMDb, Goodreads, and others. In addition to my passion for computer science, I am an avid music enthusiast, playing guitar and piano for nine years. I also enjoy reading (scientific, computer, crime, fantasy, science fiction) and video games (FPS, RPG, multiplayer games, adventure). As part of human development projects, I have participated in volunteer activities such as Sept de Coeur, where I taught French, English, and computer science to disadvantaged people with the Coeur du Cinq association, and InGame, where I organized an online video game tournament during the lockdown. I am fluent in English and have scored 100/120 on the TOEFL. Having studied International Trade at the University of Paris Descartes and Management of Commercial Units (MUC) at the Lycée de Bras Fusil in Réunion, I also have a solid background in commerce and management. Please feel free to contact me to discuss my skills and your needs. I am confident that my profile and experience can be an asset to your company.",
  "jobTitle": "Software Engineer",
  "aboutMenu": "About",
  "homeMenu": "Home",
  "portfolioMenu": "Portfolio",
  "contactMenu": "Contact",
  "articlesMenu": "Articles",
  "article1Title": "Implementation of Automated Performance Indicators",
  "article1Summary": "article1Summary",
  "article1Text": "When I joined Thales as a software engineer, I found myself in an environment where the data necessary to monitor the team's work was scattered across several platforms, including Jira, Excel, and Salesforce. The diversity of data sources and the need for consolidated and efficient tracking for the SCRUM Master both posed a challenge and an opportunity.\n\nThe main issue was to improve operational efficiency and team productivity. The challenge for me lay in the seamless integration of these various platforms and in manipulating the data accordingly. I was also aware of the associated risks, particularly the potential integration difficulties of all these sources and the complexity of the tools.\n\nI then embarked on an ambitious project: to create an automated dashboard consolidating the data from all these tools. The goal was to provide the SCRUM Master with a unified view of the team's performance, while identifying areas requiring improvements.\n\nOver the following three months, I implemented scripts to extract data from each platform, before developing mechanisms to automate the process. Concurrently, I designed the dashboard according to the needs of the SCRUM Master. This achievement required a deep understanding of the tools, the ability to manage data from diverse sources, and a skill in automation.\n\nIn the end, the effort paid off. The automated dashboards improved visibility of the team's work for the SCRUM Master, thus facilitating decision-making. On a personal level, I gained valuable experience in data manipulation and automation.\n\nBeyond the project, the implementation of these dashboards led to significant time savings and more informed decision-making, adding value to Thales. For my part, I was able to strengthen my expertise in data management and automation, which undoubtedly enriched my profile as a software engineer.\n\nToday, I look back at this project with a sense of pride. I learned the importance of automation and how it can enhance operational efficiency. If I were to undertake a similar project in the future, I would seek to involve end users more from the beginning, in order to better understand their needs and accordingly tailor the solutions I develop.",
  "article2Title": "Revolution in Performance Prediction: My Experience with Machine Learning in Project Performance Forecasting",
  "article2Summary": "article2Summary",
  "article2Text": "At Degetel, a reputable digital services company, I had the opportunity to dive into the complex world of project performance prediction. With a multitude of variable factors to consider, predicting the future became an ever-growing challenge. But it was a challenge I was ready to tackle.\n\nConvinced of the effectiveness of machine learning in handling these complex situations, I decided to use my Python skills to create predictive models. I was driven by the idea of facilitating goal-setting for future projects and thus improving Degetel's operational efficiency.\n\nAfter weeks of development, testing, and optimization, my models were ready to be deployed. I used the Google Cloud platform to create interactive dashboards, allowing for a clear visualization of the forecasts generated by my models.\n\nThe success of this initiative exceeded our expectations. The dashboards not only provided a better understanding of project performance, but they also improved the transparency and efficiency of decision-making. On my part, this experience allowed me to deepen my skills in machine learning and Python, and to become more familiar with the Google Cloud Platform.\n\nBeyond the immediate positive impact on Degetel, this project had lasting repercussions. Project planning and management improved, and I gained valuable self-confidence, which served me in subsequent projects.\n\nLooking back, I view this experience with pride. I learned that with the right tools and a thoughtful approach, we can turn challenges into opportunities and raw data into valuable insights. In retrospect, I cherish this experience as a significant milestone in my career. Not only did I have the opportunity to apply my machine learning skills to a real-world problem, but I also contributed to transforming decision-making at Degetel. If I were to revisit a project of this nature, I would place even greater emphasis on collaboration with users to maximize the value of predictions and further tailor the models to their specific needs.",
  "article3Title": "Creation of an Internal Site Enhancing Administrative Efficiency",
  "article3Summary": "article3Summary",
  "article3Text": "When I was at ESIEA, a reputable engineering school, I had the opportunity to work on an exciting project. It involved developing an internal site for the administrative staff, as part of the ERP I was working on. This site was meant to facilitate access to the student list and improve administrative operations.\n\nThe project had a dual objective. On one hand, it aimed to enhance the efficiency of the administrative staff by streamlining access to information. On the other hand, I had to ensure that the site complied with ISO standards, an important requirement for the school.\n\nIn this context, I designed the site ensuring it met the specific needs of the administrative team. I created an interface where staff could easily access the student list, click on a student's profile for more information, export the data in XLSX or DOCX formats as needed, and automatically generate ISO sheets.\n\nThe development of the site took several weeks and involved many steps, ranging from the design of the interface to the integration of different features and quality assurance. The biggest challenge was to create a tool that was both easy to use and complied with ISO standards.\n\nThe feedback was overwhelmingly positive. The administrative staff found the site extremely useful, and the time required to accomplish certain tasks was reduced. Compliance with ISO standards was also ensured, which contributed to reinforcing the school's image.\n\nOn a personal level, this project allowed me to strengthen my web development and project management skills. I also learned to work with ISO standards, which proved very useful later.\n\nLooking back, I'm proud of this accomplishment. Not only did it bring tangible value to the school, but it also enabled me to acquire valuable skills. Reflecting on this accomplishment, I am proud of the tangible impact of my work. The site I developed not only simplified administrative tasks, but also strengthened the school's compliance with ISO standards. On a personal level, this experience reinforced my awareness of the importance of user-centered development and standards compliance. If a similar opportunity arose again, I would invest more time researching existing JavaScript libraries. This would likely simplify the development process and expedite the product delivery.",
  "article4Title": "Ensuring Code Quality with Unit Testing in Go: My Experience with TDD for ERP",
  "article4Summary": "article4Summary",
  "article4Text": "Throughout my professional journey, I've always been aware of the importance of code quality for the success of a project. When I worked on the backend development of the ERP, I put this belief into practice by using Test-Driven Development (TDD) methodology and the Go programming language.\n\nThe project had significant stakes. We needed a robust backend for our ERP that could ensure an efficient link between various data sources. It was essential that our code was reliable, efficient, and easy to maintain, regardless of the changes made.\n\nIn this context, I decided to adopt a TDD approach using Go for creating unit tests. I started by clearly defining the requirements and expected functionalities. Then, I wrote unit tests for each functionality before even writing the code itself. This process allowed me to verify the accuracy of the code right from the start and correct it if needed before moving on to the next step.\n\nUnit testing in Go helped me ensure that each part of the code worked as expected, independently of others. This was crucial for maintaining code quality throughout the project and ensuring the ERP's smooth operation.\n\nThis approach had a significant impact. It enabled quick detection and correction of errors, thus improving overall development efficiency. Moreover, it made the code more robust and easy to maintain, which had long-term benefits for the ERP.\n\nOn a personal level, this project allowed me to strengthen my skills in TDD and Go. I also learned about the importance of rigor and foresight in software development.\n\nLooking back, I am proud of how I managed this project. I succeeded in maintaining a high level of code quality despite the challenges. If I were to undertake a similar project in the future, I would continue to use TDD and aim to further improve test coverage to ensure optimal code quality.",
  "article5Title": "Analyzing the Technological Environment",
  "article5Summary": "article5Summary",
  "article5Text": "Analyzing the technological environment involves evaluating and comparing existing technologies, tools, and services to identify potential solutions that meet the client's needs. This is an essential process to guide strategic decisions, optimize resources, and achieve defined goals.\n\nAs a computer engineer, this skill has been vital in my role, especially during a recent project which involved creating a website to catalogue company documents. The first step of this project was to conduct a comparative study of existing technologies, including SharePoint, as well as different methods of connecting to databases.\n\nIn conducting this analysis, I identified several limitations of existing approaches. For instance, I found that using SharePoint presented challenges in terms of permission management and navigating documents. Moreover, some methods of connecting to databases were not as efficient or secure as they could be.\n\nBased on this analysis, I was able to propose a suitable solution that allowed for the creation of a document management site with an appropriate permission system. This solution was designed to overcome the identified challenges, offering more intuitive navigation and more efficient permission management. Additionally, it improved the security and efficiency of database connections.\n\nWhile I believe I have a strong mastery of analyzing the technological environment, I recognize that there are always opportunities for learning and improvement. The field of technology is rapidly evolving, and it is essential to stay informed about the latest trends and innovations.\n\nIn the future, I plan to continue refining this skill, keeping up with the latest technological advancements and looking for opportunities to apply this knowledge to new projects. Additionally, I am interested in developing my skills in managing technological projects, so that I can effectively handle larger and more complex projects.",
  "article6Title": "Software Feature Development through Business Domain Modeling and Integration of External Components",
  "article6Summary": "article6Summary",
  "article6Text": "The ability to develop software features through business domain modeling and integration of external components is crucial for enhancing code quality and facilitating future developments. This involves not only understanding the technical requirements but also having a solid understanding of the business needs to create solutions that effectively address commercial issues.\n\nIn my role as a software engineer, I had the opportunity to exercise this skill during a recent project, which involved implementing enhancements for the ERP (Enterprise Resource Planning) of ESIEA. Part of this project included the integration of Hasura to store data from the old ERP, and the use of Apollo in VueJS to retrieve this data for analysis.\n\nIncorporating Hasura facilitated a more efficient management of the ERP data by providing a graphical interface to interact with the database. Moreover, using Apollo in VueJS enabled the retrieval and analysis of this data in a way that was both flexible and performant.\n\nThese enhancements made the ERP more functional and user-friendly, which positively impacted the operational efficiency of ESIEA.\n\nWhile I believe I have a strong grasp of software feature development through business domain modeling and integration of external components, I recognize that this field is constantly evolving. Therefore, it's important to continue to stay abreast of the latest technologies and practices to ensure high code quality and facilitate future developments.\n\nFor the future, I plan to deepen my understanding of different frameworks and libraries that can be used to enhance software development. Moreover, I plan to explore further how the principles of business domain modeling can be applied to solve more complex business problems.",
  "article7Title": "Developing Features of an Existing Software Considering Future Evolutions",
  "article7Summary": "article7Summary",
  "article7Text": "Developing the features of existing software involves not only understanding and appreciating its history but also considering potential future evolutions. This requires a deep understanding of current and future requirements, as well as the ability to design and implement scalable solutions.\n\nDuring my experience as a software engineer at ESIEA, I had the opportunity to develop this skill during a project to create a new ERP. This project involved incorporating all data and features from the old ERP, as well as adding new features to increase productivity and improve the user experience.\n\nAs part of this project, I had to not only understand the history and operation of the old ERP, but I also had to consider how the ERP might evolve in the future. This involved considering the possibility that the software might be taken over by a third party in the future. To ensure the longevity and scalability of the software, I therefore designed and implemented features in a way that they would be easy to understand, maintain, and evolve.\n\nDespite my solid skills in developing features for existing software, I am aware that technologies and best practices continue to evolve. It is therefore essential to stay up-to-date and continue to develop this skill.\n\nLooking to the future, I plan to continue to develop my skill in this area. This will involve staying up-to-date on the latest technologies and trends, as well as seeking opportunities to apply this knowledge to future projects. In addition, I am interested in exploring how software engineering techniques can be used to improve the longevity and scalability of software.",
  "article8Title": "Tracking User Requests and Bug Management",
  "article8Summary": "article8Summary",
  "article8Text": "Ensuring the tracking of user requests and leveraging tracking tools to identify and correct bugs is a key skill for any software engineer. It is essential to be able to respond effectively to user requests and to ensure that all bugs are resolved to guarantee the smooth functioning of applications.\n\nDuring my tenure at Thales, this skill was crucial in my role where I was creating automated dashboards for the management of agile teams. I used Jira, a popular tracking tool, to receive and manage requests from the different teams.\n\nEach team could submit tickets describing their specific needs and any potential issues encountered with the dashboard. Thanks to Jira, I was able to track these requests, identify problems, and work on solutions. This included correcting bugs, implementing evolutionary updates, and adapting the application to the changing needs of users.\n\nThis experience not only strengthened my skills in tracking user requests and bug management but also underscored the importance of communication and collaboration with users to understand and respond to their needs.\n\nI recognize that tracking user requests and bug management are continually evolving skills, particularly with the development of new tools and techniques. In the future, I plan to continue deepening my knowledge in these areas, staying up-to-date with the latest tools and best practices, and seeking opportunities to apply this skill in new contexts.",
  "project1title": "Full Stack Developer",
  "project1description": "Development of back-end and front-end for various web applications, including websites and content management applications. Use of technologies such as NodeJS, Express, TailwindCSS, different JS frameworks such as VueJS/Angular/React/SolidJS, and databases like MongoDB or MariaDB/MySQL.",
  "project2title": "Business Intelligence Developer",
  "project2description": "Development of Business Intelligence solutions to assist companies in making more informed decisions. Use of technologies such as Power BI/GCP/Tableau, Python, SQL, and NoSQL.",
  "project3title": "Artificial Intelligence Developer",
  "project3description": "Development of AI solutions to assist companies in automating processes and improving operational efficiency. Use of technologies such as Python, TensorFlow, PyTorch, Pandas.",
  "backToTop": "Back to top",
  "footer": "Benjamin Payet. All rights reserved.",
  "portfolioproject1title": "MyPerfectList",
  "portfolioproject1text": "MyPerfectList is a WEB platform that brings together various existing collections (IMDb, MAL, etc.) and allows the creation of new ones accessible to everyone, with the aim of centralizing user data from these different sites. Therefore, it eliminates the need to use multiple links to various different sites to know a person's tastes and to be able to have an overview of all the database sites that the user is a member of, as well as to view their customized lists.",
  "portfolioproject2title": "Trip Over Time",
  "portfolioproject2text": "\"Trip Over Time\" (T.O.T) is a 2D adventure game where players navigate through time: Viking past in \"Skyrim,\" present-day Amazon in \"Mowgli,\" and zombie-infested future in \"Paradise.\" Each level features unique enemies and challenges, with a significant boss at the end. Gameplay involves basic keyboard and mouse controls, while sound effects are creatively crafted by the team members. The game offers potential multiplayer modes, mini-games, progression boosts, and controller compatibility, promising diverse and immersive gameplay.",
  "portfolioproject3title": "ERP ESIEA",
  "portfolioproject3text": "In the context of my professional experience, I spearheaded the development of an ERP for ESIEA, using Go for the backend and VueJS for the frontend. This initiative enabled the implementation of efficient and effective solutions for various administrative tasks. I was specifically responsible for designing the student management module, which allows detailed and personalized tracking of each student. Data migration from the old ERP to the new one was a significant challenge due to the complexity and volume of data to handle. However, with thorough analysis and careful planning, I successfully carried out the migration without data loss and within the stipulated time frame. This project allowed me to strengthen my Go and VueJS programming skills and familiarize myself with managing large-scale projects."
}
