{
  "myProgrammerPortfolio": "Mon Portfolio de Programmeur",
  "contactEmail": "votre.email@example.com",
  "aboutMe": "À propos de moi",
  "aboutMeText": "Je m'appelle Benjamin Payet, actuellement étudiant en 5ème année d'Ingénierie logicielle à INTECH Paris, je suis à la recherche d'une alternance de 6 mois à partir de mars pour finaliser mes études. Dynamique, curieux et persévérant, je m'investis pleinement dans mes projets. J'ai acquis une solide expérience en développement logiciel grâce à diverses expériences professionnelles, notamment en tant que développeur full-stack pour le groupe ESIEA, stagiaire en développement d'outils Dashboard chez Thales GTS, et assistant ingénieur études et développement en alternance chez DEGETEL. Mes compétences techniques incluent la maîtrise de divers langages de programmation et technologies tels que VueJS, JavaScript, MySQL, HTML, CSS, C#, Python, C++ et PHP. J'ai également travaillé sur plusieurs projets informatiques, tels que Trip Over Time, un jeu de type Mario en 2D réalisé en C#, et MyPerfectList, un site web permettant de gérer toutes ses watchlists via les APIs de MyAnimeList, IMDb, Goodreads, et d'autres. En plus de ma passion pour l'informatique, je suis un fervent amateur de musique, jouant de la guitare et du piano depuis 9 ans. J'aime également la lecture (scientifique, informatique, policière, fantastique, science-fiction) et les jeux vidéo (FPS, RPG, jeux multijoueurs, aventure). Dans le cadre de projets de formation humaine, j'ai participé à des actions bénévoles telles que Sept de Coeur, où j'ai donné des cours de français, anglais et informatique à des personnes démunies avec l'association Coeur du Cinq, et InGame, où j'ai organisé un tournoi de jeux vidéo en ligne pendant le confinement. Je parle couramment l'anglais et ai obtenu un score de 100/120 au TOEFL. Ayant étudié la Licence pro commerce international à l'Université Paris Descartes et le BTS Management des Unités Commerciales (MUC) au Lycée de Bras Fusil à la Réunion, j'ai également une solide formation en commerce et management. N'hésitez pas à me contacter pour discuter de mes compétences et de vos besoins. Je suis convaincu que mon profil et mon expérience peuvent être un atout pour votre entreprise.",
  "jobTitle": "Ingénieur Logiciel",
  "aboutMenu": "À propos",
  "homeMenu": "Accueil",
  "portfolioMenu": "Portfolio",
  "contactMenu": "Contact",
  "articlesMenu": "Articles",
  "article1Title": "Mise en Place d'Indicateurs de Performance Automatisés",
  "article1Summary": "article1Summary",
  "article1Text": "Lorsque j'ai rejoint Thales en tant qu'ingénieur logiciel, je me suis trouvé dans un environnement où les données nécessaires au suivi du travail des équipes étaient dispersées sur plusieurs plateformes, notamment Jira, Excel et Salesforce. La diversité des sources de données et la nécessité d'un suivi consolidé et efficace pour le SCRUM Master ont présenté à la fois un défi et une opportunité.  L'enjeu principal était d'améliorer l'efficacité opérationnelle et la productivité des équipes. Le défi pour moi résidait dans l'intégration harmonieuse de ces différentes plateformes et dans la manipulation des données en conséquence. J'étais également conscient des risques associés, notamment les éventuelles difficultés d'intégration de toutes ces sources et la complexité des outils.  Je me suis alors lancé dans un projet ambitieux : créer un tableau de bord automatisé consolidant les données de tous ces outils. L'objectif était de fournir au SCRUM Master une vue unifiée des performances de l'équipe, tout en identifiant les domaines nécessitant des améliorations.  Au cours des trois mois suivants, j'ai mis en place des scripts pour extraire les données de chaque plateforme, avant de développer des mécanismes pour automatiser le processus. Parallèlement, j'ai conçu le tableau de bord selon les besoins du SCRUM Master. Cette réalisation a exigé de moi une connaissance approfondie des outils, une aptitude à gérer des données de sources diverses et une compétence en automatisation.  En fin de compte, l'effort a porté ses fruits. Les tableaux de bord automatisés ont permis d'améliorer la visibilité du travail de l'équipe pour le SCRUM Master, facilitant ainsi la prise de décisions. Sur le plan personnel, j'ai acquis une expérience précieuse en matière de manipulation de données et d'automatisation.  Au-delà du projet, la mise en place de ces tableaux de bord a conduit à des gains de temps significatifs et à une prise de décision plus éclairée, apportant une valeur ajoutée à Thales. Pour ma part, j'ai pu renforcer mon expertise en matière de gestion de données et d'automatisation, ce qui a indéniablement enrichi mon profil d'ingénieur logiciel.  Aujourd'hui, je regarde ce projet avec un sentiment de fierté. J'ai appris l'importance de l'automatisation et comment elle peut améliorer l'efficacité opérationnelle. Si je devais entreprendre un projet similaire à l'avenir, je chercherais à impliquer davantage les utilisateurs finaux dès le début, afin de mieux comprendre leurs besoins et d'adapter en conséquence les solutions que je développe.",
  "article2Title": "Révolution dans la Prédiction des Performances : Mon Expérience avec le Machine Learning dans la prévison des performances de projet",
  "article2Summary": "article2Summary",
  "article2Text": "Chez Degetel, une entreprise de services numériques réputée, j'ai eu l'occasion de plonger dans l'univers complexe de la prévision des performances de projet. Avec une multitude de facteurs variables à considérer, prédire l'avenir devenait un défi grandissant. Mais c'était un défi que j'étais prêt à relever.\n\nConvaincu de l'efficacité du machine learning dans le traitement de ces situations complexes, j'ai décidé d'utiliser mes compétences en Python pour créer des modèles prédictifs. J'étais animé par l'idée de faciliter la fixation d'objectifs pour les futurs projets et d'améliorer ainsi l'efficacité opérationnelle de Degetel.\n\nAprès des semaines de développement, de tests et d'optimisation, mes modèles étaient prêts à être déployés. J'ai utilisé la plateforme Google Cloud pour créer des tableaux de bord interactifs, permettant une visualisation claire des prévisions générées par mes modèles.\n\nLe succès de cette initiative a dépassé nos attentes. Les tableaux de bord ont non seulement permis une meilleure compréhension des performances de projet, mais ils ont aussi amélioré la transparence et l'efficacité de la prise de décisions. De mon côté, cette expérience m'a permis d'approfondir mes compétences en machine learning et en Python, et de me familiariser davantage avec Google Cloud Platform.\n\nAu-delà de l'impact positif immédiat sur Degetel, ce projet a eu des répercussions durables. La planification et la gestion des projets se sont améliorées, et j'ai acquis une précieuse confiance en moi, qui m'a servi dans d'autres projets ultérieurs.\n\nAvec du recul, je regarde cette expérience avec fierté. J'ai appris qu'avec les bons outils et une approche réfléchie, nous pouvons transformer les défis en opportunités et les données brutes en informations précieuses. Avec du recul, je chéris cette expérience comme un jalon significatif dans ma carrière. Non seulement j'ai eu l'opportunité d'appliquer mes compétences en machine learning à une problématique réelle, mais j'ai également contribué à transformer la prise de décision chez Degetel. Si je devais revisiter un projet de ce genre, je mettrais un accent encore plus fort sur la collaboration avec les utilisateurs pour maximiser la valeur des prédictions et adapter davantage les modèles à leurs besoins spécifiques.",
  "article3Title": "Création d'un Site Interne Améliorant l'Efficacité Administrative",
  "article3Summary": "article3Summary",
  "article3Text": "Lorsque j'étais à l'ESIEA, une école d'ingénieurs réputée, j'ai eu l'opportunité de travailler sur un projet passionnant. Il s'agissait de développer un site interne pour le personnel administratif, dans le cadre de l'ERP sur lequel je travaillais. Ce site devait faciliter l'accès à la liste des étudiants et améliorer les opérations administratives.\n\nLe projet s'inscrivait dans un double objectif. D'une part, il s'agissait d'améliorer l'efficacité du personnel administratif en rationalisant l'accès à l'information. D'autre part, je devais veiller à ce que le site réponde aux normes ISO, une exigence importante pour l'école.\n\nDans ce contexte, j'ai conçu le site en veillant à ce qu'il réponde aux besoins spécifiques de l'équipe administrative. J'ai créé une interface où le personnel pouvait accéder facilement à la liste des étudiants, cliquer sur le profil d'un étudiant pour obtenir plus d'informations, exporter les données en formats XLSX ou DOCX selon les besoins et générer des fiches ISO automatiquement.\n\nLe développement du site a pris plusieurs semaines et a impliqué de nombreuses étapes, allant de la conception de l'interface à l'intégration de différentes fonctionnalités et à l'assurance qualité. Le plus grand défi était de créer un outil qui soit à la fois facile à utiliser et conforme aux normes ISO.\n\nLes retours ont été très positifs. Le personnel administratif a trouvé le site extrêmement utile, et le temps nécessaire pour accomplir certaines tâches a été réduit. Le respect des normes ISO a également été assuré, ce qui a contribué à renforcer l'image de l'école.\n\nSur le plan personnel, ce projet m'a permis de renforcer mes compétences en développement web et en gestion de projets. J'ai également appris à travailler avec les normes ISO, ce qui s'est avéré très utile par la suite.\n\nEn regardant en arrière, je suis fier de cette réalisation. Non seulement elle a apporté une valeur tangible à l'école, mais elle m'a aussi permis d'acquérir des compétences précieuses. En réfléchissant à cette réalisation, je suis fier de l'impact tangible de mon travail. Le site que j'ai développé a non seulement simplifié les tâches administratives, mais a également renforcé la conformité de l'école aux normes ISO. Sur le plan personnel, cette expérience a renforcé ma prise de conscience de l'importance d'un développement centré sur l'utilisateur et du respect des normes. Si une opportunité similaire se présentait à nouveau, j'investirais davantage de temps dans la recherche de bibliothèques JavaScript existantes. Cela aurait probablement permis de simplifier le processus de développement et d'accélérer la livraison du produit.",
  "article4Title": "Assurer la Qualité du Code avec les Tests Unitaires en Go : Mon Expérience de TDD pour l'ERP",
  "article4Summary": "article4Summary",
  "article4Text": "Au cours de mon parcours professionnel, j'ai toujours été conscient de l'importance de la qualité du code pour la réussite d'un projet. Lorsque j'ai travaillé sur le développement du back-end de l'ERP, j'ai mis cette conviction en pratique en utilisant la méthodologie du développement piloté par les tests (TDD) et le langage de programmation Go.\n\nLe projet présentait des enjeux importants. Nous avions besoin d'un back-end solide pour notre ERP qui pouvait assurer un lien efficace entre les différentes sources de données. Il était essentiel que notre code soit fiable, efficace et facile à maintenir, quelles que soient les modifications apportées.\n\nC'est dans ce contexte que j'ai décidé d'adopter une approche TDD en utilisant Go pour la création de tests unitaires. J'ai commencé par définir clairement les exigences et les fonctionnalités attendues. Ensuite, j'ai écrit des tests unitaires pour chaque fonctionnalité avant même d'écrire le code lui-même. Ce processus m'a permis de vérifier l'exactitude du code dès le départ et de le corriger si nécessaire avant de passer à l'étape suivante.\n\nLes tests unitaires en Go m'ont aidé à garantir que chaque partie du code fonctionnait comme prévu, indépendamment des autres. Cela a été crucial pour maintenir la qualité du code tout au long du projet et pour assurer le bon fonctionnement de l'ERP.\n\nCette approche a eu un impact significatif. Elle a permis de détecter et de corriger les erreurs rapidement, améliorant ainsi l'efficacité globale du développement. De plus, elle a rendu le code plus robuste et facile à maintenir, ce qui a eu des avantages à long terme pour l'ERP.\n\nSur le plan personnel, ce projet m'a permis de renforcer mes compétences en TDD et en Go. J'ai également appris l'importance de la rigueur et de la prévoyance dans le développement de logiciels.\n\nAvec le recul, je suis fier de la manière dont j'ai géré ce projet. J'ai réussi à maintenir un haut niveau de qualité du code malgré les défis. Si je devais entreprendre un projet similaire à l'avenir, je continuerais à utiliser le TDD et je chercherais à améliorer encore davantage la couverture des tests pour assurer une qualité optimale du code.",
  "article5Title": "Analyse de l'Environnement Technologique",
  "article5Summary": "article5Summary",
  "article5Text": "Analyser l'environnement technologique implique l'évaluation et la comparaison des technologies, des outils et des services existants pour identifier les solutions potentielles qui répondent aux besoins du client. Il s'agit d'un processus essentiel pour orienter les décisions stratégiques, optimiser les ressources et atteindre les objectifs définis.\n\nEn tant qu'ingénieur en informatique, cette compétence a été essentielle dans le cadre de mon rôle, notamment lors d'un projet récent qui consistait à créer un site web pour répertorier les documents d'entreprise. La première étape de ce projet a été de mener une étude comparative des technologies existantes, y compris SharePoint, ainsi que des différentes méthodes de connexion aux bases de données.\n\nEn procédant à cette analyse, j'ai identifié plusieurs limites des approches existantes. Par exemple, j'ai constaté que l'utilisation de SharePoint présentait des défis en termes de gestion des autorisations et de navigation dans les documents. De plus, certaines méthodes de connexion aux bases de données n'étaient pas aussi efficaces ou sécurisées qu'elles pourraient l'être.\n\nSur la base de cette analyse, j'ai pu proposer une solution adaptée qui a permis de créer un site de gestion de documents avec un système d'autorisations approprié. Cette solution a été conçue pour surmonter les défis identifiés, en offrant une navigation plus intuitive et une gestion plus efficace des permissions. De plus, elle a amélioré la sécurité et l'efficacité des connexions à la base de données.\n\nMême si j'estime avoir une maîtrise solide de l'analyse de l'environnement technologique, je reconnais qu'il y a toujours des possibilités d'apprentissage et d'amélioration. Le domaine de la technologie évolue rapidement, et il est essentiel de rester informé des dernières tendances et innovations.\n\nDans le futur, je prévois de continuer à affiner cette compétence, en me tenant au courant des dernières avancées technologiques et en cherchant des opportunités pour appliquer ces connaissances à de nouveaux projets. De plus, je suis intéressé par le développement de mes compétences en gestion de projets technologiques, afin de pouvoir gérer efficacement des projets de plus grande envergure et de plus grande complexité.",
  "article6Title": "Développement des Fonctionnalités du Logiciel par Modélisation d'un Domaine Métier et Intégration de Composants Externes",
  "article6Summary": "article6Summary",
  "article6Text": "La capacité à développer des fonctionnalités logicielles par la modélisation d'un domaine métier et l'intégration de composants externes est essentielle pour améliorer la qualité du code et faciliter les développements futurs. Il s'agit non seulement de comprendre les exigences techniques, mais aussi d'avoir une compréhension solide des besoins de l'entreprise pour créer des solutions qui répondent de manière efficace aux problèmes commerciaux.\n\nDans le cadre de mon rôle en tant qu'ingénieur en logiciel, j'ai eu l'occasion d'exercer cette compétence lors d'un projet récent, qui consistait à mettre en œuvre des améliorations pour l'ERP (Enterprise Resource Planning) de l'ESIEA. Une partie de ce projet comprenait l'intégration de Hasura pour stocker les données de l'ancien ERP, et l'utilisation d'Apollo dans VueJS pour récupérer ces données pour analyse.\n\nL'incorporation de Hasura a facilité une gestion plus efficiente des données de l'ERP en fournissant une interface graphique pour interagir avec la base de données. De plus, l'utilisation d'Apollo dans VueJS a permis de récupérer et d'analyser ces données d'une manière qui était à la fois flexible et performante.\n\nCes améliorations ont permis de rendre l'ERP plus fonctionnel et plus facile à utiliser, ce qui a eu un impact positif sur l'efficacité opérationnelle de l'ESIEA.\n\nBien que j'estime avoir une solide maîtrise du développement de fonctionnalités de logiciels grâce à la modélisation d'un domaine métier et à l'intégration de composants externes, je suis conscient que ce domaine est en constante évolution. Par conséquent, il est important de continuer à se tenir au courant des dernières technologies et pratiques pour assurer une qualité de code élevée et faciliter les développements futurs.\n\nPour l'avenir, j'envisage d'approfondir ma compréhension des différents frameworks et bibliothèques qui peuvent être utilisés pour améliorer le développement de logiciels. De plus, je prévois d'explorer davantage comment les principes de la modélisation du domaine métier peuvent être appliqués pour résoudre des problèmes commerciaux plus complexes.",
  "article7Title": "Développement de Fonctionnalités d'un Logiciel Existant en Prendre en Compte les Évolutions Futures",
  "article7Summary": "article7Summary",
  "article7Text": "Développer les fonctionnalités d'un logiciel existant implique non seulement la compréhension et l'appréciation de son histoire, mais aussi la considération des évolutions futures potentielles. Cela exige une compréhension approfondie des exigences actuelles et futures, ainsi que de la capacité à concevoir et à mettre en œuvre des solutions évolutives.\n\nAu cours de mon expérience en tant qu'ingénieur logiciel à l'ESIEA, j'ai eu l'occasion de développer cette compétence lors d'un projet de création d'un nouvel ERP. Ce projet a impliqué l'incorporation de toutes les données et fonctionnalités de l'ancien ERP, ainsi que l'ajout de nouvelles fonctionnalités pour augmenter la productivité et améliorer l'expérience utilisateur.\n\nDans le cadre de ce projet, j'ai non seulement dû comprendre l'histoire et le fonctionnement de l'ancien ERP, mais j'ai également dû envisager comment l'ERP pourrait évoluer à l'avenir. Cela a impliqué la prise en compte de l'éventualité que le logiciel puisse être repris par un tiers à l'avenir. Pour garantir la pérennité et l'évolutivité du logiciel, j'ai donc conçu et mis en œuvre les fonctionnalités de manière à ce qu'elles soient faciles à comprendre, à maintenir et à faire évoluer.\n\nMalgré ma solide maîtrise dans le développement de fonctionnalités pour les logiciels existants, je suis conscient que les technologies et les meilleures pratiques continuent d'évoluer. Il est donc essentiel de rester à jour et de continuer à développer cette compétence.\n\nEn regardant vers l'avenir, je prévois de continuer à développer ma compétence dans ce domaine. Cela impliquera de rester à jour sur les dernières technologies et tendances, ainsi que de chercher des opportunités pour appliquer ces connaissances à des projets futurs. De plus, je suis intéressé à explorer comment les techniques d'ingénierie logicielle peuvent être utilisées pour améliorer la pérennité et l'évolutivité des logiciels.",
  "article8Title": "Suivi des Demandes Utilisateurs et Gestion des Anomalies",
  "article8Summary": "article8Summary",
  "article8Text": "L'assurance du suivi des demandes utilisateurs et l'exploitation d'outils de suivi pour identifier et corriger les anomalies est une compétence clé pour tout ingénieur logiciel. Il est essentiel de pouvoir répondre efficacement aux demandes des utilisateurs et de s'assurer que toutes les anomalies sont résolues pour garantir le bon fonctionnement des applications.\n\nPendant mon séjour chez Thales, cette compétence était cruciale dans mon rôle où je créais des tableaux de bord automatisés pour la gestion des équipes agiles. J'utilisais Jira, un outil de suivi populaire, pour recevoir et gérer les demandes des différentes équipes.\n\nChaque équipe pouvait soumettre des tickets décrivant leurs besoins spécifiques et les éventuels problèmes rencontrés avec le tableau de bord. Grâce à Jira, j'étais capable de suivre ces demandes, d'identifier les problèmes et de travailler sur des solutions. Cela comprenait la correction des anomalies, la mise en œuvre de mises à jour évolutives et l'adaptation de l'application aux besoins changeants des utilisateurs.\n\nCette expérience a non seulement renforcé ma compétence dans le suivi des demandes des utilisateurs et la gestion des anomalies, mais elle a aussi souligné l'importance de la communication et de la collaboration avec les utilisateurs pour comprendre et répondre à leurs besoins.\n\nJe reconnais que le suivi des demandes des utilisateurs et la gestion des anomalies sont des compétences en constante évolution, en particulier avec le développement de nouveaux outils et techniques. Dans l'avenir, je prévois de continuer à approfondir ma connaissance de ces domaines, en restant à jour avec les derniers outils et meilleures pratiques, et en cherchant des opportunités pour appliquer cette compétence dans de nouveaux contextes.",
  "project1title": "Développeur Full Stack",
  "project1description": "Développement de back-end et de front-end pour différentes applications web, y compris des sites web et des applications de gestion de contenu. Utilisation de technologies telles que NodeJS, Express, TailwindCSS, différents frameworks JS tels que VueJS/Angular/React/SolidJS, des base de données MongoDB ou MariaDB/MySQL",
  "project2title": "Développeur en Business Intelligence",
  "project2description": "Développement de solutions de Business Intelligence pour aider les entreprises à prendre des décisions plus éclairées. Utilisation de technologies telles que Power BI/GCP/Tableau, Python, SQL et NoSQL.",
  "project3title": "Développeur d'Intelligence Artificielle",
  "project3description": "Développement de solutions d'IA pour aider les entreprises à automatiser les processus et à améliorer l'efficacité opérationnelle. Utilisation de technologies telles que Python, TensorFlow, PyTorch, Pandas",
  "backToTop": "Retour en haut",
  "footer": "Benjamin Payet. Tous droits réservés.",
  "portfolioproject1title": "MyPerfectList",
  "portfolioproject1text": "MyPerfectList est une Plateforme WEB regroupant différentes collections existantes (IMDb, MAL, etc) et permettant d'en créer d'autres accessible à tous en ayant pour but de centraliser les données des utilisateurs de ses differents sites. Elle permettra donc de ne plus avoir besoin d'utiliser plusieurs liens vers plusiseurs sites differents afin de connaitre les gouts d'une personne et de pouvoir avoir une vue d'ensemble de tous les sites de base de données auquel l'utilisateur est membre ainsi que de voir ses listes personnalisés.",
  "portfolioproject2title": "Trip Over Time",
  "portfolioproject2text": "\"Trip Over Time\" (T.O.T) est un jeu d'aventure en 2D où les joueurs naviguent à travers le temps : le passé Viking dans \"Skyrim\", l'Amazonie actuelle dans \"Mowgli\", et un futur infesté de zombies dans \"Paradise\". Chaque niveau présente des ennemis et des défis uniques, avec un boss important à la fin. Le gameplay implique des commandes de base au clavier et à la souris, tandis que les effets sonores sont créativement conçus par les membres de l'équipe. Le jeu propose des modes multijoueurs potentiels, des mini-jeux, des boosts de progression, et la compatibilité avec les contrôleurs, promettant un gameplay diversifié et immersif.",
  "portfolioproject3title": "ERP ESIEA",
  "portfolioproject3text": "Dans le cadre de mon expérience professionnelle, j'ai mené un projet de développement d'un ERP pour l'ESIEA, en utilisant Go pour le backend et VueJS pour le front. Cette initiative a permis de mettre en œuvre des solutions performantes et efficaces pour la gestion des différentes tâches administratives. J'ai notamment été en charge de la conception du module de gestion des étudiants, qui permet un suivi détaillé et personnalisé de chaque élève. La migration des données de l'ancien ERP vers le nouveau a été un véritable défi en raison de la complexité et de la quantité de données à traiter. Cependant, grâce à une analyse approfondie et une planification minutieuse, j'ai réussi à effectuer la migration sans perte de données et dans les délais impartis. Ce projet m'a permis de renforcer mes compétences en programmation Go et VueJS, et de me familiariser avec la gestion de projets d'envergure."
}
